[
  {
    "title": "Crazy Rich Asians",
    "overview": "An American-born Chinese economics professor accompanies her boyfriend to Singapore for his best friend's wedding, only to get thrust into the lives of Asia's rich and famous.",
    "releaseDate": "2018-08-15",
    "language": "en",
    "countries": ["US"],
    "genres": ["Comedy", "Drama", "Romance"],
    "directors": ["Jon M. Chu"],
    "tmdbId": 455207,
    "watchedOn": "2021-01-20",
    "rating": 5
  },
  {
    "title": "Do the Right Thing",
    "overview": "Salvatore \"Sal\" Fragione is the Italian owner of a pizzeria in Brooklyn. A neighborhood local, Buggin' Out, becomes upset when he sees that the pizzeria's Wall of Fame exhibits only Italian actors. Buggin' Out believes a pizzeria in a black neighborhood should showcase black actors, but Sal disagrees. The wall becomes a symbol of racism and hate to Buggin' Out and to other people in the neighborhood, and tensions rise.",
    "releaseDate": "1989-06-14",
    "language": "en",
    "countries": ["US"],
    "genres": ["Drama"],
    "directors": ["Spike Lee"],
    "tmdbId": 925,
    "watchedOn": "2021-01-30",
    "rating": 8
  },
  {
    "title": "Bacurau",
    "overview": "Bacurau, a small town in the Brazilian sertão, mourns the loss of its matriarch, Carmelita, who lived to be 94. Days later, its inhabitants notice that their community has vanished from most maps.",
    "releaseDate": "2019-08-29",
    "language": "pt",
    "countries": ["BR", "FR"],
    "genres": ["Mystery", "Western", "Thriller"],
    "directors": ["Kleber Mendonça Filho", "Juliano Dornelles"],
    "tmdbId": 446159,
    "watchedOn": "2021-02-07",
    "rating": 7
  },
  {
    "title": "Onward",
    "overview": "In a suburban fantasy world, two teenage elf brothers embark on an extraordinary quest to discover if there is still a little magic left out there.",
    "releaseDate": "2020-02-29",
    "language": "en",
    "countries": ["US"],
    "genres": ["Family", "Animation", "Adventure", "Comedy", "Fantasy"],
    "directors": ["Dan Scanlon"],
    "tmdbId": 508439,
    "watchedOn": "2021-02-14",
    "rating": 7
  },
  {
    "title": "World of Tomorrow",
    "overview": "A little girl is taken on a mind-bending tour of her distant future.",
    "releaseDate": "2015-01-22",
    "language": "en",
    "countries": ["US"],
    "genres": ["Animation", "Drama", "Science Fiction"],
    "directors": ["Don Hertzfeldt"],
    "tmdbId": 303867,
    "watchedOn": "2021-02-16",
    "rating": 8
  },
  {
    "title": "World of Tomorrow Episode Two: The Burden of Other People's Thoughts",
    "overview": "Emily Prime is swept into the brain of an incomplete backup clone of her future self.",
    "releaseDate": "2017-09-22",
    "language": "en",
    "countries": ["US"],
    "genres": ["Science Fiction", "Animation", "Drama"],
    "directors": ["Don Hertzfeldt"],
    "tmdbId": 471495,
    "watchedOn": "2021-02-16",
    "rating": 6
  },
  {
    "title": "World of Tomorrow Episode Three: The Absent Destinations of David Prime",
    "overview": "A hidden memory sends David across the far reaches of time and space to solve a deadly mystery involving his time-traveling future selves.",
    "releaseDate": "2020-10-09",
    "language": "en",
    "countries": ["US"],
    "genres": ["Animation", "Science Fiction", "Drama"],
    "directors": ["Don Hertzfeldt"],
    "tmdbId": 729775,
    "watchedOn": "2021-02-16",
    "rating": 6
  },
  {
    "title": "Ip Man",
    "overview": "A semi-biographical account of Yip Man, the first martial arts master to teach the Chinese martial art of Wing Chun. The film focuses on events surrounding Ip that took place in the city of Foshan between the 1930s to 1940s during the Second Sino-Japanese War. Directed by Wilson Yip, the film stars Donnie Yen in the lead role, and features fight choreography by Sammo Hung.",
    "releaseDate": "2008-12-12",
    "language": "cn",
    "countries": ["CN", "HK"],
    "genres": ["Drama", "Action", "History"],
    "directors": ["Wilson Yip"],
    "tmdbId": 14756,
    "watchedOn": "2021-02-20",
    "rating": 6
  },
  {
    "title": "The Bee Gees: How Can You Mend a Broken Heart",
    "overview": "The story of the triumphs and hurdles of brothers Barry, Maurice, and Robin Gibb, otherwise known as the Bee Gees. The iconic trio, who found early fame in the 1960s, went on to write over 1,000 songs and have 20 No. 1 hits throughout their career, transcending more than five decades of changing tastes and styles.",
    "releaseDate": "2020-10-08",
    "language": "en",
    "countries": ["US"],
    "genres": ["Music", "Documentary"],
    "directors": ["Frank Marshall"],
    "tmdbId": 730009,
    "watchedOn": "2021-02-21",
    "rating": 7
  },
  {
    "title": "Crooked House",
    "overview": "A private investigator helps a former flame solve the murder of her wealthy grandfather, who lived in a sprawling estate surrounded by his idiosyncratic family.",
    "releaseDate": "2017-09-06",
    "language": "en",
    "countries": ["GB"],
    "genres": ["Drama", "Mystery", "Crime"],
    "directors": ["Gilles Paquet-Brenner"],
    "tmdbId": 419835,
    "watchedOn": "2021-03-07",
    "rating": 7
  },
  {
    "title": "Coraline",
    "overview": "When Coraline moves to an old house, she feels bored and neglected by her parents. She finds a hidden door with a bricked up passage. During the night, she crosses the passage and finds a parallel world where everybody has buttons instead of eyes, with caring parents and all her dreams coming true. When the Other Mother invites Coraline to stay in her world forever, the girl refuses and finds that the alternate reality where she is trapped is only a trick to lure her.",
    "releaseDate": "2009-02-05",
    "language": "en",
    "countries": ["US"],
    "genres": ["Animation", "Family", "Fantasy"],
    "directors": ["Henry Selick"],
    "tmdbId": 14836,
    "watchedOn": "2021-03-14",
    "rating": 8
  },
  {
    "title": "ParaNorman",
    "overview": "In the town of Blithe Hollow, Norman Babcock can speak to the dead, but no one other than his eccentric new friend believes his ability is real. One day, Norman's eccentric uncle tells him of a ritual he must perform to protect the town from a curse cast by a witch centuries ago.",
    "releaseDate": "2012-08-03",
    "language": "en",
    "countries": ["US"],
    "genres": ["Family", "Animation", "Adventure", "Comedy"],
    "directors": ["Sam Fell", "Chris Butler"],
    "tmdbId": 77174,
    "watchedOn": "2021-03-15",
    "rating": 7
  },
  {
    "title": "My Brother Is Getting Married",
    "overview": "Adopted by a well-off Swiss couple with slightly older son and daughter, Vinh never cut off links with his country of origin. Postcards from the adoptive family regularly conveyed to Vinh's mother in Vietnam reassurance about the warmth and nurturing environment that she always wished for her boy. Now grown up, Vinh is getting married; after so many years, the wedding is the ideal opportunity for his mother, accompanied by uncle Dac, to visit the adoptive family. Nothing would cause a greater consternation among its members. The parents underwent a less than amicable divorce, the father is bankrupt, the sister estranged, the elder brother brooding, the model family broken up. What can be done to prevent the unavoidable and profound disappointment of Vinh's mother and uncle Dac when they discover the fiasco?",
    "releaseDate": "2006-08-08",
    "language": "fr",
    "countries": ["FR"],
    "genres": ["Drama", "Comedy"],
    "directors": ["Jean-Stéphane Bron"],
    "tmdbId": 54884,
    "watchedOn": "2021-03-18",
    "rating": 4
  },
  {
    "title": "Minari",
    "overview": "A Korean-American family moves to Arkansas in search of their own American Dream. With the arrival of their sly, foul-mouthed, but incredibly loving grandmother, the stability of their relationships is challenged even more in this new life in the rugged Ozarks, testing the undeniable resilience of family and what really makes a home.",
    "releaseDate": "2021-02-12",
    "language": "en",
    "countries": ["US"],
    "genres": ["Drama"],
    "directors": ["Lee Isaac Chung"],
    "tmdbId": 615643,
    "watchedOn": "2021-03-21",
    "rating": 9
  },
  {
    "title": "Emma.",
    "overview": "In 1800s England, a well-meaning but selfish young woman meddles in the love lives of her friends.",
    "releaseDate": "2020-02-13",
    "language": "en",
    "countries": ["GB"],
    "genres": ["Comedy", "Romance"],
    "directors": ["Autumn de Wilde"],
    "tmdbId": 556678,
    "watchedOn": "2021-03-28",
    "rating": 6
  },
  {
    "title": "Wolfwalkers",
    "overview": "In a time of superstition and magic, when wolves are seen as demonic and nature an evil to be tamed, a young apprentice hunter comes to Ireland with her father to wipe out the last pack. But when she saves a wild native girl, their friendship leads her to discover the world of the Wolfwalkers and transform her into the very thing her father is tasked to destroy.",
    "releaseDate": "2020-10-26",
    "language": "en",
    "countries": ["FR", "IE", "LU"],
    "genres": ["Animation", "Family", "Adventure", "Fantasy"],
    "directors": ["Tomm Moore", "Ross Stewart"],
    "tmdbId": 441130,
    "watchedOn": "2021-03-29",
    "rating": 8
  },
  {
    "title": "Song of the Sea",
    "overview": "The story of the last Seal Child’s journey home. After their mother’s disappearance, Ben and Saoirse are sent to live with Granny in the city. When they resolve to return to their home by the sea, their journey becomes a race against time as they are drawn into a world Ben knows only from his mother’s folktales. But this is no bedtime story; these fairy folk have been in our world far too long. It soon becomes clear to Ben that Saoirse is the key to their survival.",
    "releaseDate": "2014-09-06",
    "language": "en",
    "countries": ["IE", "BE", "DK", "FR", "LU"],
    "genres": ["Family", "Animation", "Fantasy"],
    "directors": ["Tomm Moore"],
    "tmdbId": 110416,
    "watchedOn": "2021-03-30",
    "rating": 8
  },
  {
    "title": "The Secret of Kells",
    "overview": "Adventure awaits 12 year old Brendan who must fight Vikings and a serpent god to find a crystal and complete the legendary Book of Kells. In order to finish Brother Aiden's book, Brendan must overcome his deepest fears on a secret quest that will take him beyond the abbey walls and into the enchanted forest where dangerous mythical creatures hide. Will Brendan succeed in his quest?",
    "releaseDate": "2009-02-09",
    "language": "en",
    "countries": ["BE", "FR", "IE"],
    "genres": ["Animation", "Family", "Fantasy"],
    "directors": ["Tomm Moore", "Nora Twomey"],
    "tmdbId": 26963,
    "watchedOn": "2021-03-31",
    "rating": 7
  },
  {
    "title": "Miss Americana",
    "overview": "A raw and emotionally revealing look at one of the most iconic artists of our time during a transformational period in her life as she learns to embrace her role not only as a songwriter and performer, but as a woman harnessing the full power of her voice.",
    "releaseDate": "2020-01-31",
    "language": "en",
    "countries": ["US"],
    "genres": ["Documentary", "Music"],
    "directors": ["Lana Wilson"],
    "tmdbId": 653567,
    "watchedOn": "2021-04-10",
    "rating": 5
  },
  {
    "title": "Big Hero 6",
    "overview": "A special bond develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.",
    "releaseDate": "2014-10-24",
    "language": "en",
    "countries": ["US"],
    "genres": ["Adventure", "Family", "Animation", "Action", "Comedy"],
    "directors": ["Chris Williams", "Don Hall"],
    "tmdbId": 177572,
    "watchedOn": "2021-04-30",
    "rating": 7
  },
  {
    "title": "mother!",
    "overview": "A couple's relationship is tested when uninvited guests arrive at their home, disrupting their tranquil existence.",
    "releaseDate": "2017-09-13",
    "language": "en",
    "countries": ["US"],
    "genres": ["Drama", "Horror", "Mystery"],
    "directors": ["Darren Aronofsky"],
    "tmdbId": 381283,
    "watchedOn": "2021-05-01",
    "rating": 6
  },
  {
    "title": "The Father",
    "overview": "A man refuses all assistance from his daughter as he ages and, as he tries to make sense of his changing circumstances, he begins to doubt his loved ones, his own mind and even the fabric of his reality.",
    "releaseDate": "2021-02-26",
    "language": "en",
    "countries": ["GB", "FR"],
    "genres": ["Drama"],
    "directors": ["Florian Zeller"],
    "tmdbId": 600354,
    "watchedOn": "2021-05-02",
    "rating": 8
  },
  {
    "title": "Hunt for the Wilderpeople",
    "overview": "Ricky is a defiant young city kid who finds himself on the run with his cantankerous foster uncle in the wild New Zealand bush. A national manhunt ensues, and the two are forced to put aside their differences and work together to survive.",
    "releaseDate": "2016-03-31",
    "language": "en",
    "countries": ["NZ"],
    "genres": ["Adventure", "Comedy", "Drama"],
    "directors": ["Taika Waititi"],
    "tmdbId": 371645,
    "watchedOn": "2021-05-13",
    "rating": 10
  },
  {
    "title": "The Irishman",
    "overview": "Pennsylvania, 1956. Frank Sheeran, a war veteran of Irish origin who works as a truck driver, accidentally meets mobster Russell Bufalino. Once Frank becomes his trusted man, Bufalino sends him to Chicago with the task of helping Jimmy Hoffa, a powerful union leader related to organized crime, with whom Frank will maintain a close friendship for nearly twenty years.",
    "releaseDate": "2019-11-01",
    "language": "en",
    "countries": ["US"],
    "genres": ["Crime", "Drama", "History"],
    "directors": ["Martin Scorsese"],
    "tmdbId": 398978,
    "watchedOn": "2021-05-18",
    "rating": 7
  },
  {
    "title": "Mary and Max",
    "overview": "A tale of friendship between two unlikely pen pals: Mary, a lonely, eight-year-old girl living in the suburbs of Melbourne, and Max, a forty-four-year old, severely obese man living in New York. In the mid-1970s, a homely, friendless Australian girl of 8 picks a name out of a Manhattan phone book and writes to him; she includes a chocolate bar. He writes back, with chocolate. Thus begins a 20-year correspondence. Will the two ever meet face to face?",
    "releaseDate": "2009-02-09",
    "language": "en",
    "countries": ["AU"],
    "genres": ["Animation", "Comedy", "Drama"],
    "directors": ["Adam Elliot"],
    "tmdbId": 24238,
    "watchedOn": "2021-05-22",
    "rating": 7
  },
  {
    "title": "The Courier",
    "overview": "Cold War spy Greville Wynne and his Russian source try to put an end to the Cuban Missile Crisis.",
    "releaseDate": "2021-03-18",
    "language": "en",
    "countries": ["GB", "US"],
    "genres": ["Thriller", "History", "Drama"],
    "directors": ["Dominic Cooke"],
    "tmdbId": 522241,
    "watchedOn": "2021-05-28",
    "rating": 7
  },
  {
    "title": "Birds of Prey (and the Fantabulous Emancipation of One Harley Quinn)",
    "overview": "Harley Quinn joins forces with a singer, an assassin and a police detective to help a young girl who had a hit placed on her after she stole a rare diamond from a crime lord.",
    "releaseDate": "2020-02-05",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Crime"],
    "directors": ["Cathy Yan"],
    "tmdbId": 495764,
    "watchedOn": "2021-05-29",
    "rating": 6
  },
  {
    "title": "Cruella",
    "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
    "releaseDate": "2021-05-26",
    "language": "en",
    "countries": ["GB", "US"],
    "genres": ["Comedy", "Crime"],
    "directors": ["Craig Gillespie"],
    "tmdbId": 337404,
    "watchedOn": "2021-05-31",
    "rating": 6
  },
  {
    "title": "Shazam!",
    "overview": "A boy is given the ability to become an adult superhero in times of need with a single magic word.",
    "releaseDate": "2019-03-29",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Comedy", "Fantasy"],
    "directors": ["David F. Sandberg"],
    "tmdbId": 287947,
    "watchedOn": "2021-06-02",
    "rating": 6
  },
  {
    "title": "The New Mutants",
    "overview": "Five young mutants, just discovering their abilities while held in a secret facility against their will, fight to escape their past sins and save themselves.",
    "releaseDate": "2020-08-26",
    "language": "en",
    "countries": ["US"],
    "genres": ["Horror", "Science Fiction"],
    "directors": ["Josh Boone"],
    "tmdbId": 340102,
    "watchedOn": "2021-06-09",
    "rating": 3
  },
  {
    "title": "This Town",
    "overview": "Five years after being acquitted for the murder of his family, Sean (White) is finally ready to move on with life. But the bitter ex-cop (Malcolm) who led the investigation remains adamant that he's guilty - and will stop at nothing to bring him down.",
    "releaseDate": "2020-04-30",
    "language": "en",
    "countries": ["NZ"],
    "genres": ["Comedy"],
    "directors": ["David White"],
    "tmdbId": 673640,
    "watchedOn": "2021-06-21",
    "rating": 8
  },
  {
    "title": "Black Widow",
    "overview": "Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
    "releaseDate": "2021-07-07",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Adventure", "Science Fiction"],
    "directors": ["Cate Shortland"],
    "tmdbId": 497698,
    "watchedOn": "2021-07-09",
    "rating": 3
  },
  {
    "title": "The Mauritanian",
    "overview": "The true story of the Mauritanian Mohamedou Ould Slahi, who was held at the U.S military's Guantanamo Bay detention center without charges for over a decade and sought help from a defense attorney for his release.",
    "releaseDate": "2021-02-10",
    "language": "en",
    "countries": ["GB", "US"],
    "genres": ["Drama", "Thriller"],
    "directors": ["Kevin Macdonald"],
    "tmdbId": 644583,
    "watchedOn": "2021-07-16",
    "rating": 8
  },
  {
    "title": "Bo Burnham: Inside",
    "overview": "Stuck in COVID-19 lockdown, US comedian and musician Bo Burnham attempts to stay sane and happy by writing, shooting and performing a one-man comedy special.",
    "releaseDate": "2021-07-22",
    "language": "en",
    "countries": ["US"],
    "genres": ["Comedy"],
    "directors": ["Bo Burnham"],
    "tmdbId": 823754,
    "watchedOn": "2021-07-18",
    "rating": 7
  },
  {
    "title": "A Prophet",
    "overview": "Sentenced to six years in prison, Malik El Djebena is alone in the world and can neither read nor write. On his arrival at the prison, he seems younger and more brittle than the others detained there. At once he falls under the sway of a group of Corsicans who enforce their rule in the prison. As the 'missions' go by, he toughens himself and wins the confidence of the Corsican group.",
    "releaseDate": "2009-08-26",
    "language": "fr",
    "countries": ["FR", "IT"],
    "genres": ["Crime", "Drama"],
    "directors": ["Jacques Audiard"],
    "tmdbId": 21575,
    "watchedOn": "2021-07-19",
    "rating": 7
  },
  {
    "title": "The Suicide Squad",
    "overview": "Supervillains Harley Quinn, Bloodsport, Peacemaker and a collection of nutty cons at Belle Reve prison join the super-secret, super-shady Task Force X as they are dropped off at the remote, enemy-infused island of Corto Maltese.",
    "releaseDate": "2021-07-28",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Adventure", "Fantasy"],
    "directors": ["James Gunn"],
    "tmdbId": 436969,
    "watchedOn": "2021-08-17",
    "rating": 4
  },
  {
    "title": "Paddington",
    "overview": "A young Peruvian bear travels to London in search of a new home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family.",
    "releaseDate": "2014-11-24",
    "language": "en",
    "countries": ["FR", "GB", "US"],
    "genres": ["Comedy", "Adventure", "Family"],
    "directors": ["Paul King"],
    "tmdbId": 116149,
    "watchedOn": "2021-09-13",
    "rating": 6
  },
  {
    "title": "Paddington 2",
    "overview": "Paddington, now happily settled with the Browns, picks up a series of odd jobs to buy the perfect present for his Aunt Lucy, but it is stolen.",
    "releaseDate": "2017-11-09",
    "language": "en",
    "countries": ["FR", "GB", "US"],
    "genres": ["Adventure", "Comedy", "Family"],
    "directors": ["Paul King"],
    "tmdbId": 346648,
    "watchedOn": "2021-09-14",
    "rating": 5
  },
  {
    "title": "The Green Knight",
    "overview": "An epic fantasy adventure based on the timeless Arthurian legend, The Green Knight tells the story of Sir Gawain, King Arthur's reckless and headstrong nephew, who embarks on a daring quest to confront the eponymous Green Knight, a gigantic emerald-skinned stranger and tester of men.",
    "releaseDate": "2021-07-29",
    "language": "en",
    "countries": ["CA", "IE", "GB", "US"],
    "genres": ["Adventure", "Drama", "Fantasy"],
    "directors": ["David Lowery"],
    "tmdbId": 559907,
    "watchedOn": "2021-09-18",
    "rating": 8
  },
  {
    "title": "Shang-Chi and the Legend of the Ten Rings",
    "overview": "Shang-Chi must confront the past he thought he left behind when he is drawn into the web of the mysterious Ten Rings organization.",
    "releaseDate": "2021-09-01",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Adventure", "Fantasy"],
    "directors": ["Destin Daniel Cretton"],
    "tmdbId": 566525,
    "watchedOn": "2021-09-20",
    "rating": 7
  },
  {
    "title": "Enola Holmes",
    "overview": "While searching for her missing mother, intrepid teen Enola Holmes uses her sleuthing skills to outsmart big brother Sherlock and help a runaway lord.",
    "releaseDate": "2020-09-23",
    "language": "en",
    "countries": ["US"],
    "genres": ["Mystery", "Crime", "Adventure"],
    "directors": ["Harry Bradbeer"],
    "tmdbId": 497582,
    "watchedOn": "2021-09-21",
    "rating": 6
  },
  {
    "title": "Venom",
    "overview": "Investigative journalist Eddie Brock attempts a comeback following a scandal, but accidentally becomes the host of Venom, a violent, super powerful alien symbiote. Soon, he must rely on his newfound powers to protect the world from a shadowy organization looking for a symbiote of their own.",
    "releaseDate": "2018-09-28",
    "language": "en",
    "countries": ["CN", "US"],
    "genres": ["Science Fiction", "Action"],
    "directors": ["Ruben Fleischer"],
    "tmdbId": 335983,
    "watchedOn": "2021-09-22",
    "rating": 7
  },
  {
    "title": "Chicken Run",
    "overview": "Having been hopelessly repressed and facing eventual certain death at the British chicken farm where they are held, Ginger the chicken along with the help of Rocky the American rooster decide to rebel and lead their fellow chickens in a great escape from the murderous farmers Mr. and Mrs. Tweedy and their farm of doom.",
    "releaseDate": "2000-06-21",
    "language": "en",
    "countries": ["GB", "US", "FR"],
    "genres": ["Animation", "Comedy", "Family"],
    "directors": ["Nick Park", "Peter Lord"],
    "tmdbId": 7443,
    "watchedOn": "2021-09-25",
    "rating": 7
  },
  {
    "title": "No Time to Die",
    "overview": "Bond has left active service and is enjoying a tranquil life in Jamaica. His peace is short-lived when his old friend Felix Leiter from the CIA turns up asking for help. The mission to rescue a kidnapped scientist turns out to be far more treacherous than expected, leading Bond onto the trail of a mysterious villain armed with dangerous new technology.",
    "releaseDate": "2021-09-29",
    "language": "en",
    "countries": ["GB", "US"],
    "genres": ["Adventure", "Action", "Thriller"],
    "directors": ["Cary Joji Fukunaga"],
    "tmdbId": 370172,
    "watchedOn": "2021-10-02",
    "rating": 6
  },
  {
    "title": "Dune",
    "overview": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive.",
    "releaseDate": "2021-09-15",
    "language": "en",
    "countries": ["US"],
    "genres": ["Science Fiction", "Adventure"],
    "directors": ["Denis Villeneuve"],
    "tmdbId": 438631,
    "watchedOn": "2021-10-16",
    "rating": 8
  },
  {
    "title": "2001: A Space Odyssey",
    "overview": "Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer.",
    "releaseDate": "1968-04-02",
    "language": "en",
    "countries": ["GB", "US"],
    "genres": ["Science Fiction", "Mystery", "Adventure"],
    "directors": ["Stanley Kubrick"],
    "tmdbId": 62,
    "watchedOn": "2021-10-17",
    "rating": 7
  },
  {
    "title": "The French Dispatch",
    "overview": "The quirky staff of an American magazine based in 1970s France puts out its last issue, with stories featuring an artist sentenced to life imprisonment, student riots, and a kidnapping resolved by a chef.",
    "releaseDate": "2021-10-21",
    "language": "en",
    "countries": ["DE", "US"],
    "genres": ["Comedy", "Drama", "Romance"],
    "directors": ["Wes Anderson"],
    "tmdbId": 542178,
    "watchedOn": "2021-10-21",
    "rating": 9
  },
  {
    "title": "Eternals",
    "overview": "The Eternals are a team of ancient aliens who have been living on Earth in secret for thousands of years. When an unexpected tragedy forces them out of the shadows, they are forced to reunite against mankind’s most ancient enemy, the Deviants.",
    "releaseDate": "2021-11-03",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Adventure", "Fantasy", "Science Fiction"],
    "directors": ["Chloé Zhao"],
    "tmdbId": 524434,
    "watchedOn": "2021-11-13",
    "rating": 5
  },
  {
    "title": "The Power of the Dog",
    "overview": "A domineering but charismatic rancher wages a war  of intimidation on his brother's new wife and her teen son, until long-hidden secrets come to light.",
    "releaseDate": "2021-11-17",
    "language": "en",
    "countries": ["AU", "CA", "NZ", "GB"],
    "genres": ["Drama", "Western"],
    "directors": ["Jane Campion"],
    "tmdbId": 600583,
    "watchedOn": "2021-11-29",
    "rating": 9
  },
  {
    "title": "Borga",
    "overview": "\"Borga\" is Better. A Borga is a Ghanaian abroad living an excessive wealthy lifestyle. At least that's what they want everyone to believe.",
    "releaseDate": "2021-10-28",
    "language": "de",
    "countries": ["DE"],
    "genres": ["Drama"],
    "directors": ["York-Fabian Raabe"],
    "tmdbId": 777930,
    "watchedOn": "2021-11-7",
    "rating": 7
  },
  {
    "title": "Better Days",
    "overview": "At his best friend's New Year's Eve party, Gary desperately tries to spark the interest of Ann, his ex-girlfriend, without letting his friends embarrass him, but ends up receiving devastating news instead.",
    "releaseDate": "2019-02-16",
    "language": "en",
    "countries": ["US"],
    "genres": ["Comedy", "Drama"],
    "directors": ["Alessio Di Giambattista"],
    "tmdbId": 638841,
    "watchedOn": "2021-11-9",
    "rating": 7
  },
  {
    "title": "Robin Robin",
    "overview": "A bird raised by mice begins to question where she belongs and sets off on a daring journey of self-discovery.",
    "releaseDate": "2021-10-09",
    "language": "en",
    "countries": ["GB"],
    "genres": ["Animation", "Adventure", "Family", "Music"],
    "directors": ["Michael Please", "Daniel Ojari"],
    "tmdbId": 649928,
    "watchedOn": "2021-12-01",
    "rating": 6
  },
  {
    "title": "The Tree House",
    "overview": "In 2045, a filmmaker lands on Mars and tries to make a film. “Home… Far away from home”, he recalls faces of people, thus a collection of moving images emerge.",
    "releaseDate": "2019-08-12",
    "language": "vi",
    "countries": ["DE", "CN", "FR", "SG", "VN"],
    "genres": ["Documentary", "Science Fiction"],
    "directors": ["Truong Minh Quy"],
    "tmdbId": 616319,
    "watchedOn": "2021-12-04",
    "rating": 3
  },
  {
    "title": "Brick",
    "overview": "A teenage loner pushes his way into the underworld of a high school crime ring to investigate the disappearance of his ex-girlfriend.",
    "releaseDate": "2006-03-31",
    "language": "en",
    "countries": ["US"],
    "genres": ["Drama", "Mystery"],
    "directors": ["Rian Johnson"],
    "tmdbId": 9270,
    "watchedOn": "2021-12-07",
    "rating": 7
  },
  {
    "title": "Beetlejuice",
    "overview": "Thanks to an untimely demise via drowning, a young couple end up as poltergeists in their New England farmhouse, where they fail to meet the challenge of scaring away the insufferable new owners, who want to make drastic changes. In desperation, the undead newlyweds turn to an expert frightmeister, but he's got a diabolical agenda of his own.",
    "releaseDate": "1988-03-30",
    "language": "en",
    "countries": ["US"],
    "genres": ["Fantasy", "Comedy"],
    "directors": ["Tim Burton"],
    "tmdbId": 4011,
    "watchedOn": "2021-12-09",
    "rating": 5
  },
  {
    "title": "The Last Duel",
    "overview": "King Charles VI declares that Knight Jean de Carrouges settle his dispute with his squire, Jacques Le Gris, by challenging him to a duel.",
    "releaseDate": "2021-10-13",
    "language": "en",
    "countries": ["GB", "US"],
    "genres": ["Action", "Drama", "History"],
    "directors": ["Ridley Scott"],
    "tmdbId": 617653,
    "watchedOn": "2021-12-12",
    "rating": 8
  },
  {
    "title": "Sorry We Missed You",
    "overview": "Ricky and his family have been fighting an uphill struggle against debt since the 2008 financial crash. An opportunity to wrestle back some independence appears with a shiny new van and the chance to run a franchise as a self-employed delivery driver. It's hard work, and his wife's job as a carer is no easier. The family unit is strong but when both are pulled in different directions everything comes to breaking point.",
    "releaseDate": "2019-10-04",
    "language": "en",
    "countries": ["BE", "FR", "GB"],
    "genres": ["Drama"],
    "directors": ["Ken Loach"],
    "tmdbId": 522369,
    "watchedOn": "2021-12-13",
    "rating": 9
  },
  {
    "title": "The Housemaid",
    "overview": "A man's affair with his family's housemaid leads to a dark consequences. Eun-yi is hired as an au pair for Hae-ra (pregnant with twins) and her rich husband Hoon. Eun-yi's primary task is watching the couple's young daughter, Nami. Eun-yi is eager to connect to Nami, who gradually warms to her. Hoon begins to secretly flirt with Eun-yi, enticing her with glasses of wine and his piano playing, and they eventually begin a sexual relationship. Despite the affair, Eun-yi is still warm and friendly to Hoon's oblivious wife, Hae-ra. She even expresses enthusiasm and delight at the progress of Hae-ra's pregnancy.",
    "releaseDate": "2010-05-13",
    "language": "ko",
    "countries": ["KR"],
    "genres": ["Thriller", "Drama"],
    "directors": ["Im Sang-soo"],
    "tmdbId": 45202,
    "watchedOn": "2021-12-14",
    "rating": 7
  },
  {
    "title": "House of Gucci",
    "overview": "When Patrizia Reggiani, an outsider from humble beginnings, marries into the Gucci family, her unbridled ambition begins to unravel the family legacy and triggers a reckless spiral of betrayal, decadence, revenge, and ultimately…murder.",
    "releaseDate": "2021-11-24",
    "language": "en",
    "countries": ["CA", "GB", "US"],
    "genres": ["Drama", "Crime", "Thriller"],
    "directors": ["Ridley Scott"],
    "tmdbId": 644495,
    "watchedOn": "2021-12-15",
    "rating": 7
  },
  {
    "title": "Spider-Man",
    "overview": "After being bitten by a genetically altered spider at Oscorp, nerdy but endearing high school student Peter Parker is endowed with amazing powers to become the superhero known as Spider-Man.",
    "releaseDate": "2002-05-01",
    "language": "en",
    "countries": ["US"],
    "genres": ["Fantasy", "Action"],
    "directors": ["Sam Raimi"],
    "tmdbId": 557,
    "watchedOn": "2021-12-17",
    "rating": 5
  },
  {
    "title": "Spider-Man 2",
    "overview": "Peter Parker is going through a major identity crisis. Burned out from being Spider-Man, he decides to shelve his superhero alter ego, which leaves the city suffering in the wake of carnage left by the evil Doc Ock. In the meantime, Parker still can't act on his feelings for Mary Jane Watson, a girl he's loved since childhood. A certain anger begins to brew in his best friend Harry Osborn as well...",
    "releaseDate": "2004-06-25",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Adventure", "Fantasy"],
    "directors": ["Sam Raimi"],
    "tmdbId": 558,
    "watchedOn": "2021-12-19",
    "rating": 4
  },
  {
    "title": "The Amazing Spider-Man",
    "overview": "Peter Parker is an outcast high schooler abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben and Aunt May. Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance – leading him directly to Oscorp and the lab of Dr. Curt Connors, his father's former partner. As Spider-Man is set on a collision course with Connors' alter ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.",
    "releaseDate": "2012-06-23",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Adventure", "Fantasy"],
    "directors": ["Marc Webb"],
    "tmdbId": 1930,
    "watchedOn": "2021-12-20",
    "rating": 6
  },
  {
    "title": "Spider-Man 3",
    "overview": "The seemingly invincible Spider-Man goes up against an all-new crop of villains—including the shape-shifting Sandman. While Spider-Man’s superpowers are altered by an alien organism, his alter ego, Peter Parker, deals with nemesis Eddie Brock and also gets caught up in a love triangle.",
    "releaseDate": "2007-05-01",
    "language": "en",
    "countries": ["US"],
    "genres": ["Fantasy", "Action", "Adventure"],
    "directors": ["Sam Raimi"],
    "tmdbId": 559,
    "watchedOn": "2021-12-21",
    "rating": 4
  },
  {
    "title": "The Amazing Spider-Man 2",
    "overview": "For Peter Parker, life is busy. Between taking out the bad guys as Spider-Man and spending time with the person he loves, Gwen Stacy, high school graduation cannot come quickly enough. Peter has not forgotten about the promise he made to Gwen’s father to protect her by staying away, but that is a promise he cannot keep. Things will change for Peter when a new villain, Electro, emerges, an old friend, Harry Osborn, returns, and Peter uncovers new clues about his past.",
    "releaseDate": "2014-04-16",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Adventure", "Fantasy"],
    "directors": ["Marc Webb"],
    "tmdbId": 102382,
    "watchedOn": "2021-12-22",
    "rating": 5
  },
  {
    "title": "The Matrix Resurrections",
    "overview": "Plagued by strange memories, Neo's life takes an unexpected turn when he finds himself back inside the Matrix.",
    "releaseDate": "2021-12-16",
    "language": "en",
    "countries": ["US"],
    "genres": ["Science Fiction", "Action", "Adventure"],
    "directors": ["Lana Wachowski"],
    "tmdbId": 624860,
    "watchedOn": "2021-12-23",
    "rating": 7
  },
  {
    "title": "The Tragedy of Macbeth",
    "overview": "Macbeth, the Thane of Glamis, receives a prophecy from a trio of witches that one day he will become King of Scotland. Consumed by ambition and spurred to action by his wife, Macbeth murders his king and takes the throne for himself.",
    "releaseDate": "2021-12-05",
    "language": "en",
    "countries": ["US"],
    "genres": ["Drama", "War"],
    "directors": ["Joel Coen"],
    "tmdbId": 591538,
    "watchedOn": "2021-12-24",
    "rating": 8
  },
  {
    "title": "Venom: Let There Be Carnage",
    "overview": "After finding a host body in investigative reporter Eddie Brock, the alien symbiote must face a new enemy, Carnage, the alter ego of serial killer Cletus Kasady.",
    "releaseDate": "2021-09-30",
    "language": "en",
    "countries": ["US"],
    "genres": ["Science Fiction", "Action", "Adventure"],
    "directors": ["Andy Serkis"],
    "tmdbId": 580489,
    "watchedOn": "2021-12-24",
    "rating": 5
  },
  {
    "title": "Spider-Man: No Way Home",
    "overview": "Peter Parker is unmasked and no longer able to separate his normal life from the high-stakes of being a super-hero. When he asks for help from Doctor Strange the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.",
    "releaseDate": "2021-12-15",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Adventure", "Science Fiction"],
    "directors": ["Jon Watts"],
    "tmdbId": 634649,
    "watchedOn": "2021-12-27",
    "rating": 8
  },
  {
    "title": "Azor",
    "overview": "Yvan De Wiel, a private banker from Geneva, is going to Argentina in the midst of a dictatorship to replace his partner, the object of the most worrying rumors, who disappeared overnight. Between hushed lounges, swimming pools, and gardens under surveillance, a remote duel takes place between two bankers who, despite different methods, are the accomplices of a discreet and merciless form of colonization.",
    "releaseDate": "2021-09-10",
    "language": "fr",
    "countries": ["AR", "FR", "CH"],
    "genres": ["Drama", "Thriller"],
    "directors": ["Andreas Fontana"],
    "tmdbId": 659954,
    "watchedOn": "2022-01-03",
    "rating": 7
  },
  {
    "title": "Spencer",
    "overview": "During her Christmas holidays with the royal family at the Sandringham estate in Norfolk, England, Diana decides to leave her marriage to Prince Charles.",
    "releaseDate": "2021-11-04",
    "language": "en",
    "countries": ["CL", "DE", "GB", "US"],
    "genres": ["Drama"],
    "directors": ["Pablo Larraín"],
    "tmdbId": 716612,
    "watchedOn": "2022-01-05",
    "rating": 7
  },
  {
    "title": "Last Night in Soho",
    "overview": "A young girl, passionate about fashion design, is mysteriously able to enter the 1960s where she encounters her idol, a dazzling wannabe singer. But 1960s London is not what it seems, and time seems to be falling apart with shady consequences.",
    "releaseDate": "2021-10-21",
    "language": "en",
    "countries": ["GB"],
    "genres": ["Thriller", "Horror", "Mystery"],
    "directors": ["Edgar Wright"],
    "tmdbId": 576845,
    "watchedOn": "2022-01-06",
    "rating": 7
  },
  {
    "title": "Don't Look Up",
    "overview": "Two low-level astronomers must go on a giant media tour to warn humankind of an approaching comet that will destroy planet Earth.",
    "releaseDate": "2021-12-07",
    "language": "en",
    "countries": ["US"],
    "genres": ["Comedy", "Drama", "Science Fiction"],
    "directors": ["Adam McKay"],
    "tmdbId": 646380,
    "watchedOn": "2022-01-08",
    "rating": 7
  },
  {
    "title": "The Dawn Wall",
    "overview": "In the middle of Yosemite National Park towers El Capitan, a huge block of granite whose smoothest side, the Dawn Wall, is said to be the most difficult rock climb in the world. Tommy Caldwell didn’t see inhospitable terrain, but rather a puzzle almost a kilometer tall. In The Dawn Wall, we follow him and Kevin Jorgeson in their historic ascent to the summit.",
    "releaseDate": "2017-11-01",
    "language": "en",
    "countries": ["AT"],
    "genres": ["Documentary", "Adventure"],
    "directors": ["Josh Lowell", "Peter Mortimer"],
    "tmdbId": 489471,
    "watchedOn": "2022-01-09",
    "rating": 7
  },
  {
    "title": "OSS 117: From Africa with Love",
    "overview": "The third entry in secret agent OSS 117's parodic spy adventures.",
    "releaseDate": "2021-08-04",
    "language": "fr",
    "countries": ["FR"],
    "genres": ["Comedy", "Adventure", "Action"],
    "directors": ["Nicolas Bedos"],
    "tmdbId": 604563,
    "watchedOn": "2022-01-10",
    "rating": 4
  },
  {
    "title": "Annette",
    "overview": "The story of Henry, a stand-up comedian with a fierce sense of humour and Ann, a singer of international renown. In the spotlight, they are the perfect couple, healthy, happy, and glamourous. The birth of their first child, Annette, a mysterious girl with an exceptional destiny, will change their lives.",
    "releaseDate": "2021-07-06",
    "language": "en",
    "countries": ["BE", "CA", "FR", "DE", "GR", "JP", "MX", "CH"],
    "genres": ["Drama", "Romance"],
    "directors": ["Leos Carax"],
    "tmdbId": 424277,
    "watchedOn": "2022-01-14",
    "rating": 8
  },
  {
    "title": "Jacky in the Kingdom of Women",
    "overview": "The film is set in a world, the Popular Democratic Republic of Bubunne, in which women hold the power and men are forced to wear veils and stay at home.",
    "releaseDate": "2014-01-29",
    "language": "fr",
    "countries": ["FR"],
    "genres": ["Comedy"],
    "directors": ["Riad Sattouf"],
    "tmdbId": 223954,
    "watchedOn": "2022-01-19",
    "rating": 8
  },
  {
    "title": "Drive My Car",
    "overview": "Yusuke Kafuku, a stage actor and director, still unable, after two years, to cope with the loss of his beloved wife, accepts to direct Uncle Vanja at a theater festival in Hiroshima. There he meets Misaki, an introverted young woman, appointed to drive his car. In between rides, secrets from the past and heartfelt confessions will be unveiled.",
    "releaseDate": "2021-08-18",
    "language": "ja",
    "countries": ["JP"],
    "genres": ["Drama"],
    "directors": ["Ryusuke Hamaguchi"],
    "tmdbId": 758866,
    "watchedOn": "2022-01-22",
    "rating": 9
  },
  {
    "title": "Encanto",
    "overview": "The tale of an extraordinary family, the Madrigals, who live hidden in the mountains of Colombia, in a magical house, in a vibrant town, in a wondrous, charmed place called an Encanto. The magic of the Encanto has blessed every child in the family with a unique gift from super strength to the power to heal—every child except one, Mirabel. But when she discovers that the magic surrounding the Encanto is in danger, Mirabel decides that she, the only ordinary Madrigal, might just be her exceptional family's last hope.",
    "releaseDate": "2021-11-24",
    "language": "en",
    "countries": ["US"],
    "genres": ["Animation", "Comedy", "Family", "Fantasy"],
    "directors": ["Byron Howard", "Jared Bush"],
    "tmdbId": 568124,
    "watchedOn": "2022-01-24",
    "rating": 6
  },
  {
    "title": "The Lobster",
    "overview": "In a dystopian near future, single people, according to the laws of The City, are taken to The Hotel, where they are obliged to find a romantic partner in forty-five days or are transformed into animals and sent off into The Woods.",
    "releaseDate": "2015-10-15",
    "language": "en",
    "countries": ["FR", "GR", "IE", "NL", "GB"],
    "genres": ["Comedy", "Drama", "Romance"],
    "directors": ["Yorgos Lanthimos"],
    "tmdbId": 254320,
    "watchedOn": "2022-01-26",
    "rating": 10
  },
  {
    "title": "Playlist",
    "overview": "Sophie, 28, just found out she landed that job at a famous Parisian publisher. Her dream? Not exactly: she would rather see her own graphic work printed… When she tells her boyfriend Jean she is pregnant, everything explodes. They break up and she must return to waiting tables like her friend Julia, an aspiring actress. How can one survive in the city under such conditions?",
    "releaseDate": "2021-06-02",
    "language": "fr",
    "countries": ["FR"],
    "genres": ["Comedy"],
    "directors": ["Nine Antico"],
    "tmdbId": 655369,
    "watchedOn": "2022-01-28",
    "rating": 6
  },
  {
    "title": "Shiva Baby",
    "overview": "College student Danielle must cover her tracks when she unexpectedly runs into her sugar daddy at a shiva - with her parents, ex-girlfriend and family friends also in attendance.",
    "releaseDate": "2021-04-02",
    "language": "en",
    "countries": ["US"],
    "genres": ["Comedy", "Drama"],
    "directors": ["Emma Seligman"],
    "tmdbId": 664300,
    "watchedOn": "2022-02-02",
    "rating": 8
  },
  {
    "title": "Assault on Precinct 13",
    "overview": "The lone inhabitants of an abandoned police station are under attack by the overwhelming numbers of a seemingly unstoppable street gang.",
    "releaseDate": "1976-11-05",
    "language": "en",
    "countries": ["US"],
    "genres": ["Thriller", "Action", "Crime"],
    "directors": ["John Carpenter"],
    "tmdbId": 17814,
    "watchedOn": "2022-02-03",
    "rating": 6
  },
  {
    "title": "Hopscotch",
    "overview": "When CIA operative Miles Kendig deliberately lets KGB agent Yaskov get away, his boss threatens to retire him. Kendig beats him to it, however, destroying his own records and traveling to Austria where he begins work on a memoir that will expose all his former agency's covert practices. The CIA catches wind of the book and sends other agents after him, initiating a frenetic game of cat and mouse that spans the globe.",
    "releaseDate": "1980-09-26",
    "language": "en",
    "countries": ["US"],
    "genres": ["Action", "Comedy", "Thriller"],
    "directors": ["Ronald Neame"],
    "tmdbId": 32030,
    "watchedOn": "2022-02-03",
    "rating": 7
  },
  {
    "title": "Before, Now & Then",
    "overview": "Set against Indonesia’s turbulent post-independence years in the 1960s, the story revolves around the domestic life of a woman whose personal life has been completely overturned by the political turmoil.",
    "releaseDate": "2022-02-13",
    "language": "id",
    "countries": ["ID"],
    "genres": ["Drama"],
    "directors": ["Kamila Andini"],
    "tmdbId": 859933,
    "watchedOn": "2022-02-18",
    "rating": 8
  },
  {
    "title": "Licorice Pizza",
    "overview": "The story of Alana Kane and Gary Valentine growing up, running around and going through the treacherous navigation of first love in the San Fernando Valley, 1973.",
    "releaseDate": "2021-11-26",
    "language": "en",
    "countries": ["CA", "US"],
    "genres": ["Drama", "Comedy"],
    "directors": ["Paul Thomas Anderson"],
    "tmdbId": 718032,
    "watchedOn": "2022-02-19",
    "rating": 9
  },
  {
    "title": "Nightmare Alley",
    "overview": "An ambitious carnival man with a talent for manipulating people with a few well-chosen words hooks up with a female psychiatrist who is even more dangerous than he is.",
    "releaseDate": "2021-12-02",
    "language": "en",
    "countries": ["US"],
    "genres": ["Crime", "Drama", "Thriller"],
    "directors": ["Guillermo del Toro"],
    "tmdbId": 597208,
    "watchedOn": "2022-02-23",
    "rating": 8
  },
  {
    "title": "Belfast",
    "overview": "Buddy is a young boy on the cusp of adolescence, whose life is filled with familial love, childhood hijinks, and a blossoming romance. Yet, with his beloved hometown caught up in increasing turmoil, his family faces a momentous choice: hope the conflict will pass or leave everything they know behind for a new life.",
    "releaseDate": "2021-11-11",
    "language": "en",
    "countries": ["GB"],
    "genres": ["Drama"],
    "directors": ["Kenneth Branagh"],
    "tmdbId": 777270,
    "watchedOn": "2022-02-25",
    "rating": 9
  },
  {
    "title": "The House",
    "overview": "Across different eras, a poor family, an anxious developer and a fed-up landlady become tied to the same mysterious house in this animated dark comedy.",
    "releaseDate": "2022-01-14",
    "language": "en",
    "countries": ["GB"],
    "genres": ["Animation", "Drama", "Comedy", "Horror"],
    "directors": [
      "Paloma Baeza",
      "Niki Lindroth von Bahr",
      "Emma De Swaef",
      "Marc James Roels"
    ],
    "tmdbId": "926899",
    "watchedOn": "2022-03-06",
    "rating": "6"
  }
]
