{
  "title": "Crispy Oven Fries",
  "publishedOn": "2022-04-07",
  "dataTag": ["cereal"],
  "intro": "",
  "duration": "60",
  "ingredients": [
    {
      "ingTitle": "",
      "ingMand": [
        "4 large dry and mealy Russet Potatoes",
        "1 tbsp. vinegar",
        "4 tbsp. peanut oil",
        "Coarse salt"
      ],
      "ingOpt": []
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Set a pot of water on medium-high heat to boil.",
        "Meanwhile, peel the potatoes, slice them into roughly 1 cm thick fries (or your desired fry size). Preheat the oven to 230 °C.",
        "Once the water has boiled, add the vinegar and a 3 finger pinch of salt, stirring to dissolve the salt. Add the potatoes to the boiling water and set a timer for 8 minutes. When the time is up, pour the fries into a colander and let the excess steam evaporate for a couple of minutes. Note: The vinegar will slow down the breakdown of pectin so the fries do not fall apart as easily. However, they should look like they are almost falling apart, boil them longer if necessary.",
        "Add the fries to a large baking sheet and pour over the peanut oil. Mix the fries so the oil completely coats the outside of each fry. There should be a thin layer of excess oil on the pan. Add the pan to oven and set a timer for 15 minutes. Note: Peanut oil has a higher % of saturated fat meaning it will crisp food more efficiently than oils with a lower % of saturated fat like olive or canola.",
        "Pull the baking sheet out and flip them over with a spatula. At this point, you should be able to see some blistering on the outside but the fries won't be overly crisp. If they look a little dry, drizzle over more peanut oil. Add them back to the oven and bake for another 15–20 minutes. At this point, they should be slightly browned and crispy though it could take longer depending on the size of the fry, how crowded the pan is or the oil used. If they aren't crispy, let them go longer!",
        "Set a paper towel in a bowl. Pour in the fries and immediately a pinch of salt. Toss the fries with the paper towel so it absorbs the excess oil. Note: Feel free to add spices, fresh herbs, cheeses, or any flavorings of your choice during this stage. Serve and enjoy."
      ]
    }
  ],
  "notes": [],
  "recipeUrl": "https://en.wikipedia.org/wiki/Russet_potato"
}
