{
  "title": "Italian ribollita",
  "dateCreated": "2020-06-24",
  "dataTag": ["main", "fall", "winter", "ahead"],
  "intro": "Robin and I discovered ribollita during our tandem bike trip in the Chianti region. We actually rarely use the traditional ingredients, but we love the concept of using up any kinds of vegetables and old bread you have on hand to create a filling soup.",
  "duration": "80",
  "ingredients": [
    {
      "ingTitle": "",
      "ingMand": [
        "½ lb. dried cannellini beans (1 ⅓ cups)",
        "⅓ cup extra-virgin olive oil",
        "½ onion",
        "1 carrot",
        "1 celery stalk",
        "1 garlic clove",
        "2-3 thyme sprigs (leaves only)",
        "1 tsp salt",
        "1 potato, medium sized",
        "½ lb. lacinato kale (roughly a bunch)",
        "½ head Savoy cabbage (about ¾ lb.)",
        "⅓ lb. Swiss chard",
        "1 tbsp tomato paste (or ⅓ cup of canned diced tomatoes or 1 fresh tomato)",
        "½ lb. whole wheat, rustic, stale bread",
        "To taste, freshly ground black pepper"
      ],
      "ingOpt": []
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Place the (unsoaked) dried beans in the smaller pot with 4 cups of cold water and just ½ teaspoon of salt. Turn on the heat to medium and bring to a gentle boil, then turn down the heat to the lowest setting and cover with a lid. Keep simmering until cooked (between 3h and 3h30 in my experience). Otherwise use soaked beans and cook them in the same amount of water, until done (cooking time will be quicker).",
        "Meanwhile, chop the carrot, onion, and celery. Mince the garlic. Peel and dice the potatoes, clean and cut the remaining vegetables into ½-inch slices or cubes. Set aside.",
        "When the beans are cooked, drain them, reserving the cooking water. In a blender or food processor, puree about ¾ of the beans and return the bean purée to the cooking water. Set aside. Also set aside the remaining whole beans.",
        "In a large pot, prepare the soffritto: heat 1/3 cup extra-virgin olive oil, and sauté the carrot, celery, garlic and onion over medium-high heat, until golden in color, about 7-8 minutes. Stir often to avoid burning.",
        "Add the thyme leaves, the remaining 1/2 tsp of salt, the remaining fresh vegetables, the tomato paste, the bean purée with its water, along with an additional 4 cups of water. Cook over low heat, covered, for about 1 hour.",
        "Finally, add the previously cooked whole beans and the stale bread, cut into ½-inch slices, crust on. Stir, cook for another 5 minutes and turn off the heat.",
        "Let soup sit for at least a few hours, ideally overnight. Then, reheat the soup, boiling for a few minutes at low heat.",
        "Serve sprinkled with freshly ground black pepper and drizzled with a little high-quality extra-virgin olive oil."
      ]
    }
  ],
  "notes": [],
  "sourceUrl": "http://www.cookwithgrazia.com/csa-box-content/ribollita-soup-authentic-recipe/"
}
