{
  "title": "Italian bolognese",
  "publishedOn": "2023-01-01",
  "dataTag": ["main"],
  "intro": "This is Valentina's family recipe. Her great-grandma used to make her own tomato paste from scratch. Her grandma reviewed the recipe with some store-bought tomato paste, which works just fine. The secret is chopping the vegetables into super tiny pieces and using tomato paste instead of tomato sauce.",
  "duration": "120",
  "ingredients": [
    {
      "ingTitle": "For 4 servings:",
      "ingMand": [
        "250 g ground beef",
        "250 g ground pork",
        "3–4 celery stalks, finely chopped",
        "3–4 carrots, finely chopped",
        "1 big onion, finely chopped",
        "80–100 ml of white wine",
        "80 g butter + 2–3 spoons olive oil (or 100 g butter with no oil or just olive oil)",
        "Tomato paste, ideally the one with added celery and carrots"
      ],
      "ingOpt": ["100 g of bacon or pancetta"]
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Finely chop the celery, carrot an onion (as finely as possible). Add them to a big pot with high borders, add most of the butter and let the vegetables <em>soffritto</em>—cook on low heat.",
        "When the vegetables are soft (but by no means crunchy or burned), you can add the ground meat, and the wine, while keeping the flame low. Regularly stir the meat and vegetables.",
        "When you see that the wine has evaporated (or if you use no wine, when you see that meat  has slightly changed color), add the tomato paste. (And if you want, also some fresh tomato sauce, but don't go overboard with this). Cover and keep the flame low. Stir from time to time.",
        "Taste and check if you need to add more butter or oil. Add pepper and salt to your liking.",
        "After 1.5–2 hours, the sauce should be ready and the meat should start coming up towards the top. You can decide if your sauce is ready or if you want to keep cooking it longer at a very very low flame. (Valentina doesn't do it, but some grannies are cooking it for 4 hours.)"
      ]
    }
  ],
  "notes": [""],
  "sourceUrl": ""
}
