{
  "title": "Italian ravioli",
  "publishedOn": "2022-10-11",
  "dataTag": ["main"],
  "intro": "",
  "duration": "180",
  "ingredients": [
    {
      "ingTitle": "",
      "ingMand": [
        "220 g flour",
        "2 medium eggs",
        "egg white-water mixture (only water works too)"
      ],
      "ingOpt": []
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Follow a <a href='/recipes/pasta-dough'>regular pasta dough recipe</a>. Go for a slightly thinner dough than for fettuccine as stacking two sheets of pasta will make the edges twice as thick (setting 5–6). Do the full ravioli process for one sheet at a time to avoid drying.",
        "Once rolled out, cut the sheet into 30–40&nbsp;cm pieces for easier handling. Cover the remaining sheet(s) with a towel.",
        "Fold the first sheet along its midline to make a light crease and then re-open it.",
        "Working so that your filling is approximately 4&nbsp;cm in diameter and 1,5 cm apart, place six even heaping tablespoons along the lower half of the dough.",
        "Moisten the dough (around your filling) lightly with your water and pastry brush.",
        "And then fold it over along the crease, pressing from the folded point outward to remove excess air.",
        "Gently pat the dough down around each lump of filling to create a seal. Use a bench scraper to slice your ravioli into even squares. Make sure they are correclty sealed all around and set them out individually on a bit of flour.",
        "Boil some water with salt and cook the ravioli for 2 minutes.",
        "Serve your ravioli in the sauce of your choice — I personally find that a great filling often requires little more than a drizzle of olive oil and perhaps some chopped herbs and grated cheese."
      ]
    }
  ],
  "notes": [
    "Tip 1: Avoid watery fillings: Fillings that have too much cream, butter, oil, or stock come out watery and loose, and can make your dough too sticky to handle.",
    "Tip 2: Make your filling flavorful and use lots of it: Creating your own delicious filling is one of the main advantages of making it from scratch — your filling should taste good enough to eat on its own with a spoon. And once you have that perfect filling, don't hold back! You want the dough to be stuffed until it's stretched pretty tight for the right balance of filling to pasta.",
    "Tip 3: Watch out for air bubbles, but also accept that a little air is inevitable: Be sure to press out as much air as you can, regardless of the method you're using. But also know that, especially early on, you'll probably wind up with some bubbles. And guess what? Your ravioli will survive."
  ],
  "sourceUrl": "https://www.seriouseats.com/fresh-ricotta-ravioli-recipe"
}
