{
  "title": "Korean kimchijeon",
  "publishedOn": "2023-04-05",
  "dataTag": ["main", "spring"],
  "intro": "",
  "duration": "40",
  "ingredients": [
    {
      "ingTitle": "Jeon",
      "ingMand": [
        "200 g kimchi",
        "2 tbsp. kimchi brine",
        "3 scallions, chopped",
        "0.5 tsp. sugar",
        "60 g flour",
        "100 g water (start with less, add if needed)"
      ],
      "ingOpt": []
    },
    {
      "ingTitle": "Dipping sauce",
      "ingMand": [
        "1 tbsp. soy sauce",
        "2 tsp. white vinegar",
        "1 tsp. toasted sesame seeds"
      ],
      "ingOpt": [
        "1 tsp. gochugaru (hot pepper flakes)",
        "0.5 tsp. sugar",
        "1 tsp. sesame oil"
      ]
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Combine the kimchi, kimchi brine, scallions, sugar, flour, and water in a medium bowl and mix well with a spoon.",
        "Heat a 12-inch nonstick skillet over medium heat. (If you don’t have a 12-inch skillet, use a smaller skillet to make 2 pancakes.)",
        "Add 2 tablespoons of the vegetable oil and swirl to coat the bottom of the pan.",
        "Pour the batter into the pan and spread it with the back of a spoon or a spatula to make a large circle.",
        "Cook until the bottom is golden brown and crisp, 3 to 5 minutes.",
        "While the pancake is cooking, mix all the ingredients for the dipping sauce and set aside.",
        "Carefully turn the pancake over. Drizzle the remaining 2 tablespoons oil around the edges of the skillet, then lift the pancake with a thin spatula to allow the oil to run underneath and tilt the pan to spread it evenly.",
        "Cook until the bottom of the pancake is light golden brown and crisp, 3 to 5 minutes.",
        "Flip it one more time and cook for another minute.",
        "Slide onto a large serving platter and serve immediately."
      ]
    }
  ],
  "notes": [
    "Note: if eating these kimchijeon by themselves, double the quantities for two."
  ],
  "recipeUrl": "https://www.maangchi.com/recipe/kimchijeon"
}
