{
  "title": "Pasta with bean sauce",
  "publishedOn": "2020-06-24",
  "dataTag": ["main"],
  "intro": "A pasta sauce made of beans only? Yep, it is apparently possible and surprisingly good.",
  "duration": "",
  "ingredients": [
    {
      "ingTitle": "For 4 servings",
      "ingMand": [
        "0.5 cup extra-virgin olive oil",
        "1 cup walnuts, finely chopped",
        "0.5 tsp crushed red pepper flakes",
        "5 garlic cloves — 1 whole, 4 thinly sliced",
        "1 sprigs rosemary",
        "1 can white beans",
        "1.5 cup large tubular pasta",
        "salt",
        "1 lemon",
        "2 tbsp finely chopped parsley",
        "ground black pepper"
      ],
      "ingOpt": []
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Heat ¼ cup oil in a large Dutch oven or other heavy pot over medium. Add walnuts and red pepper flakes and cook, stirring often, until nuts are deeply golden, about 5 minutes. Transfer to a small bowl and grate in whole garlic clove; set aside.",
        "Wipe out pot. Combine ¼ cup oil and remaining sliced garlic in pot and cook over medium-low heat, stirring occasionally, until oil around garlic is bubbling vigorously and garlic is beginning to brown, about 5 minutes. Firmly crush rosemary in your hand to bruise; add to pot along with beans and stir to coat. Increase heat to medium and cook, stirring occasionally, until beans are just beginning to take on color, about 3 minutes.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 2 minutes less than package directions.",
        "When pasta is about 4 minutes away from being done, transfer 1 cup pasta cooking liquid to pot with beans (make sure to keep heat on medium so that the liquid doesn’t evaporate too quickly). Using a wooden spoon, gently mash about three-quarters of beans into a creamy sauce.",
        "Using a spider or slotted spoon, transfer pasta to pot with beans and add 1 cup pasta cooking liquid and 2 tbsp oil; mix well to combine. Increase heat to medium-high, bring to a simmer, and cook, stirring gently with a heatproof rubber spatula, until sauce coats pasta, about 2 minutes. (Sauce might look soupy but will thicken as it sits so don't worry!) Finely grate in about one-quarter of zest from lemon, then cut lemon in half. Squeeze in juice from 1 lemon half and add parsley; mix well to combine.",
        "Divide pasta among bowls. Drizzle with oil, season with black pepper, and top with reserved nut mixture. Slice remaining lemon half into wedges and serve alongside for squeezing over."
      ]
    }
  ],
  "notes": [],
  "sourceUrl": "https://www.bonappetit.com/recipe/pantry-pasta-with-vegan-cream-sauce/"
}
