{
  "title": "Vietnamese cháo gà",
  "publishedOn": "2022-11-30",
  "dataTag": ["main", "ahead", "fall", "winter"],
  "intro": "Reminescent of childhood memories. Chao was my mother go-to recipe whenever someone in the family would get sick.",
  "duration": "120",
  "ingredients": [
    {
      "ingTitle": "For the cháo (6–8 servings)",
      "ingMand": [
        "1 yellow onion",
        "1 whole chicken",
        "1 tbsp salt",
        "1.5 tbsp sugar",
        "250 g uncooked jasmine rice",
        "5&nbsp;cm knob fresh ginger, peeled and finely chopped",
        "1.5 tbsp fish sauce",
        "2 tsp freshly ground black pepper"
      ],
      "ingOpt": [
        "1 tsp chicken or mushroom bouillon",
        "Vegetables to be cooked (e.g. carrots, cabbage, mushrooms), cut into bite-sized pieces"
      ]
    },
    {
      "ingTitle": "For the salad",
      "ingMand": [
        "1 small green cabbage, thinly sliced",
        "1 small carrot, cut into thin matchsticks",
        "1 small red onion, thinly sliced",
        "6 tbsp apple cider vinegar",
        "3 tbsp sugar",
        "1 tsp freshly ground black pepper",
        "Handful of cilantro, tender stems and leaves"
      ],
      "ingOpt": []
    },
    {
      "ingTitle": "For the dipping sauce",
      "ingMand": [
        "2 tbsp apple cider vinegar",
        "2 tbsp sugar",
        "4 tbsp fish sauce"
      ],
      "ingOpt": ["2 chilis, finely chopped"]
    }
  ],
  "instructions": [
    {
      "insTitle": "Chicken",
      "insSteps": [
        "Bring 10 cups of water to a boil in a kettle or pot.",
        "Meanwhile, char the onion: Peel and cut the stem and root ends off the onion to create a flat top and bottom. Set a small frying pan over high heat, place the onion on its flat side to char until blackened, then flip to char the other flat side.",
        "Cook the chicken: Place the charred onion and chicken in a large pot. Pour the boiling water over it and season with salt, sugar, and chicken or mushroom bouillon, if using. Set the pot over low heat and simmer covered for 1 hour.",
        "Chill the chicken: Fill a large bowl with very cold water and set it next to the stovetop. Use a spider to carefully scoop the cooked chicken out of the pot into the cold water bath. Allow the chicken to chill for about 15 minutes in the water bath.",
        "Drain the chicken into a colander set in the sink. This will stop the chicken from cooking and makes sure it stays very tender. Note: Do not discard the hot chicken stock in the pot. You will use it to cook the rice porridge. You can discard the onion.",
        "While the rice cooks (see below), use your hands to tear the chicken meat along the grain into 1/3-inch-wide strips, removing and discarding the bones. Add the pulled chicken on a large plate and toss with the remaining 1 teaspoon black pepper."
      ]
    },
    {
      "insTitle": "Rice",
      "insSteps": [
        "While the chicken chills, rinse the rice well under cold running water (at least 3 times) and drain well. Add it to the chicken stock along with the ginger — set aside 1 teaspoon of the ginger for the dipping sauce.",
        "At this stage, add any extra vegetables you want in the soup.",
        "Cover the pot with a lid and bring it to the boil over medium heat. Skim off any fat and foam that floats to the top with a large spoon. Reduce the heat to low and simmer for 25 to 30 minutes until the rice has blossomed and thickened the broth, stirring occasionally. Season the porridge with fish sauce and 1 teaspoon black pepper. If the porridge is too thick for your liking, you can thin it out by adding a little water."
      ]
    },
    {
      "insTitle": "Salad And Dipping Sauce",
      "insSteps": [
        "For the salad: In a large bowl, add the cabbage, carrots, red onion, vinegar, sugar, and black pepper. Toss well to combine. Add the pulled chicken and cilantro, and toss to combine. Set it aside.",
        "For the sauce: In a small bowl, combine the reserved 1 teaspoon ginger, chilis, vinegar, sugar, and fish sauce. Set it aside."
      ]
    }
  ],
  "notes": [
    "Tip: Make sure to store away the porridge that won't be eaten in individual portions. It freezes really well and is perfect to defrost on a sick day. You can then reboil it with any vegetables you have on hand!"
  ],
  "sourceUrl": "https://www.simplyrecipes.com/chao-ga-vietnamese-chicken-and-rice-porridge-recipe-5324248"
}
