{
  "title": "Basic pasta dough",
  "date": "2022-10-11",
  "lang": "en",
  "dataTag": ["side", "spring", "summer", "fall", "winter"],
  "intro": "",
  "duration": "60",
  "ingredients": [
    {
      "ingTitle": "For two portions:",
      "ingMand": [
        { "value": 330, "type": "g", "name": "flour or semolina" },
        { "value": 3, "type": "", "name": "large eggs" }
      ],
      "ingOpt": []
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Make a well in the middle of the flour, add the eggs to the well. Using a fork, break and mix the eggs.",
        "Gradually start pushing the flour into the pool of egg. Keep adding flour until it no longer makes sense to use the fork — the dough will be wet and sticky, but will hold together as a single mass.",
        "At this point, scrape off any dough sticking to your fork and start using your hand. Gradually fold flour into the dough, turning the dough 45° each time to more evenly incorporate the flour (which might need to be adjusted). Once the dough feels firm and dry and can form a craggy-looking ball, it's time to start kneading.",
        "Knead for approximately 10 minutes, turning the dough 45° each time. It will allow you to get a smooth ball of dough without having to worry about drying. If your dough feels wet and tacky, add more flour as necessary.",
        "Let the dough rest for one hour under a bowl (or 30 minutes at the absolute minimum).",
        "Cut your dough into four pieces, set one aside. Flatten the dough piece to at least 1 cm thick.",
        "Then, turn to your pasta maker. Adjust it to the widest setting (usually \"0\"). Feed the dough into the roller. Turn the dial to the next setting and roll through the dough.",
        "You'll want to laminate the dough. To do so, lay the dough flat and fold in the two extremities so that its new width is a bit shorter than the machine gap. Roll the piece of dough (at a rotated angle) through the widest (lowest) setting again. You can go through the laminating process two or three times for a sturdier dough.",
        "From there, roll the dough through the pasta maker, turning the dial to the next setting each time. Stop at your preferred thickness and keep in mind that the dough will slightly thicken when cooked.",
        "If the dough becomes longer than you can reasonably handle, simply lay it down on a cutting board and cut it in half. Dust one half with flour and cover it with a kitchen towel, then continue rolling the other.",
        "At this point, you can forge onward and make noodles. This part's super easy: Just feed a dough section of dough through the fettuccine or linguine cutter. Dust it with flour, and curl it up into a little nest.",
        "Boil up some salted water, and toss those noodles in. They'll cook quickly — I'm talking 60 or 90-seconds quickly — so be ready to taste and drain them almost immediately."
      ]
    }
  ],
  "notes": [
    "Tip 1: Laminating the dough during the rolling process allows you to change up the direction in which the roller is pulling the pasta. The dough is sturdier and more manageable when I've laminated at least two or three times over the course of rolling. Be careful! What you don't want to do is forget to turn the roller back to the widest setting when you put the laminated dough back in.",
    "Tip 2: If you're planning to make fettuccine, I'd recommend rolling it to the third-to-last setting (usually, that's labeled \"6\"). If you're going to use the dough for ravioli, you'll want to go a little thinner, since stacking two sheets of pasta will make the edges twice as thick",
    "Tip 3: While fresh pasta cooks rapidly, it's important to make sure that it's thoroughly cooked. Unlike dry pasta, it actually gets slightly firmer during the first phase of cooking. If you don't cook it long enough, the egg and flour proteins won't set, your starch won't fully hydrate, and you'll end up with a kinda pasty pasta. Just don't exceed two minutes — that's when it starts to get mushy."
  ],
  "sourceUrl": "https://www.seriouseats.com/best-easy-all-purpose-fresh-pasta-dough-recipe-instructions"
}
