{
  "title": "Canned green tomato chutney",
  "date": "2022-10-06",
  "lang": "en",
  "dataTag": ["side", "summer", "fall"],
  "intro": "",
  "duration": "80",
  "ingredients": [
    {
      "ingTitle": "",
      "ingMand": [
        "1 kg green tomatoes",
        "1 kg red onions",
        "150 g raisins (or similar dried fruits)",
        "2 tsp salt",
        "500 g sugar",
        "1 liter malt, mix A (3/4 cider vinegar, 1/4 balsamic vinegar) or mix B (50:50 rice and balsamic vinegar)"
      ],
      "ingOpt": [
        "3 garlic cloves",
        "1/4 tsp chili flakes",
        "1/4 tsp black pepper"
      ]
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Prepare the vegetables. Chop the tomatoes, onions, and raisins roughly and mince the garlic.",
        "Place all ingredients into a stainless steel pan and bring to a boil. Reduce heat to a vigorous simmer and leave uncovered. Depending on batch size and your appliance's heat, it can take one to three hours. Keep an eye on it and stir regularly.",
        "The chutney is ready when it's reduced down and appears thick and brown.",
        "Spoon the chutney into warm, sterilized jars and seal with lids.",
        "Water-bath the jars to ensure that they're fully sterilized. Fill a tall pan with water and place a rack at the bottom if you have one. Bring to a boil, then lower your (still hot) jars in so that they're not touching and that there's at least an inch of water above. Bring back to a rolling boil and leave the jars in the boiling water for ten minutes. Lift them out vertically (not tilted) with a jar lifter and set them on the counter to cool. The lids will seal as the chutney cools. It may take twelve or more hours for the seal to take.",
        "Label the jars when cool and store in a dark cupboard. Refrigerate the jars once opened and try to use it within a year."
      ]
    }
  ],
  "notes": [
    "Tip 1: It's common in the UK to reuse supermarket jars for homemade chutney and to simply finish with this step. If you do this, ensure that the lid of the jar doesn't have any exposed metal since the vinegar in the recipe can react with it. The vinegar can corrode the metal turning it black and potentially affecting your chutney. It's better to use preserving jars with non-metal lids. Either plastic-coated on the inside or two-piece Tattler lids. It's also best practice to water-bath the jars after they're filled.",
    "Tip 2: If the chutney smells very vinegary after cooking, make sure to keep the jars sealed for a few weeks, as the chutney will mellow down with time."
  ],
  "sourceUrl": "https://lovelygreens.com/spicy-green-tomato-chutney/"
}
