{
  "title": "Eggplant tarte tatin",
  "date": "2023-07-29",
  "lang": "en",
  "dataTag": ["main", "summer"],
  "intro": "I love tarte tatin. This savory recipe is Asian cuisine-inspired and hits just the right spot for me.",
  "duration": "60",
  "ingredients": [
    {
      "ingTitle": "Base",
      "ingMand": [
        { "value": 2, "type": "", "name": "eggplants" },
        { "value": 3, "type": "tbsp", "name": "oil" },
        {
          "value": 1,
          "type": "",
          "name": "pie dough",
          "url": "basic-pie-dough"
        }
      ],
      "ingOpt": []
    },
    {
      "ingTitle": "Sauce",
      "ingMand": [
        "4 tbsp rice vinegar",
        "6 tbsp soy sauce",
        "4 tbsp caster sugar",
        "3 tbsp water",
        "5 cm piece fresh ginger, peeled and finely grated",
        "2 green chilies, finely sliced (or flaked chili)",
        "2 garlic cloves, peeled and finely sliced",
        "Juice of 1 lime",
        "2 garlic cloves, peeled and finely sliced"
      ],
      "ingOpt": []
    },
    {
      "ingTitle": "Garnish",
      "ingMand": [
        "1 bunch spring onions, trimmed",
        "30 g toasted peanuts",
        "Coriander and mint"
      ],
      "ingOpt": []
    }
  ],
  "instructions": [
    {
      "insTitle": "Prep the eggplants",
      "insSteps": [
        "Trim the eggplants, peel off some of the skin in strips, then cut the flesh into 2.5 cm-thick slices.",
        "Put a large, ovenproof frying pan on a medium heat, add three tablespoons of oil and fry the slices, in batches if need be, for about three minutes on each side, until lightly browned; add more oil if needed.",
        "While the eggplant is frying, whisk the sauce in a bowl: rice vinegar, soy, sugar, ginger, water and half the chili. Cut the spring onions into 2–3 cm lengths, and set aside a few of the green ends for garnish.",
        "When the eggplant is cooked, add the sliced spring onions and garlic to the pan, stir-fry for two minutes, then pour in all the soy and vinegar mixture. Bring to a bubble, simmer for a couple of minutes more, until reduced and sticky, then take off the heat."
      ]
    },
    {
      "insTitle": "Bake the pie",
      "insSteps": [
        "Heat the oven to 180 °C. Roll out the puff pastry so it's a bit larger than the frying pan, drape this over the top of the eggplant mixture and tuck it in neatly around the sides. Prick all over with a fork, then bake for 40 minutes, until the pastry is golden and the eggplant mix is bubbling up around the edges. Remove, leave to rest for two minutes, then carefully turn out on to a board.",
        "Finely slice the reserved spring onion greens, and roughly chop the peanuts, coriander and mint. Toss these with the remaining chopped chili and lime juice, sprinkle all over the top of the tart, then slice and serve."
      ]
    }
  ],
  "notes": [],
  "sourceUrl": "https://www.theguardian.com/food/2023/apr/01/vegan-sticky-aubergine-peanut-herb-tarte-tatin-recipe-georgina-hayden"
}
