{
  "title": "Flan",
  "date": "2023-08-08",
  "lang": "fr",
  "dataTag": ["dessert"],
  "intro": "L'une des premières recettes que j'ai appris à faire petite.",
  "duration": "70",
  "ingredients": [
    {
      "ingTitle": "Pour 6 pots",
      "ingMand": ["0.5 l de lait", "50 g de sucre", "3 oeufs"],
      "ingOpt": ["50 g de sucre pour le caramel", "2 c-à-s de fleur d'oranger"]
    }
  ],
  "instructions": [
    {
      "insTitle": "Caramel",
      "insSteps": [
        "Préparer le caramel en mettant un peu de sucre dans une casserole à fond épais et en faisant chauffer doucement. Ajouter un peu d'eau pour que tout le sucre fonde.",
        "Tourner la casserole de temps en temps pour homogénéiser la cuisson. Saupoudrer le sucre petit à petit lorsque celui de la casserole a fondu.",
        "Quand l'entièreté du sucre s'est transformée en caramel, augmenter le feu pour le faire dorer.",
        "Lorsque le caramel commence à prendre une jolie couleur dorée foncée, le verser dans un grand moule allant au four. Plus le caramel reste clair, plus il sera sucré. Plus le caramel est foncé et plus les notes amères ressortiront."
      ]
    },
    {
      "insTitle": "Cuisson du flan",
      "insSteps": [
        "Battre les œufs avec les 50 g de sucre restants, puis ajouter le lait préalablement chauffé et l'eau de fleur d'oranger.",
        "Verser le tout dans le moule caramélisé. Faire cuire au four à 180 °C dans un bain-marie pendant 45 minutes environ, cela peut varier en fonction de la taille du moule utilisé. Il faut que le centre soit pris mais encore légèrement tremblotant. Pour les 5–10 dernières minutes, monter la plaque de cuisson pour faire dorer le flan. Note : si le flan est divisé en portions individuelles, vérifier la cuisson après 35 minutes.",
        "Laisser refroidir puis placer au frais jusqu'au moment de servir. Pour servir, recouvrir le flan de son caramel."
      ]
    }
  ],
  "notes": [
    "Note : Il est aussi possible de cuire ces flans dans des petits pots à la vapeur."
  ],
  "sourceUrl": "https://cuisine.journaldesfemmes.fr/recette/344305-flan-aux-oeufs"
}
