{
  "title": "Indian pav bhaji",
  "date": "2020-10-10",
  "lang": "en",
  "dataTag": ["main"],
  "intro": "",
  "duration": "120",
  "ingredients": [
    {
      "ingTitle": "Bhaji masala powder",
      "ingMand": [
        "4 tbsp coriander seeds",
        "2 tbsp cumin seeds",
        "5 dried red chilies (adjust to taste)",
        "8 cloves",
        "1 tbsp fennel seeds",
        "1/2 tsp black cardamon seeds (or 24 seeds)",
        "5 cm cinnamon stick",
        "1.5 tsp turmeric powder",
        "2 tsp ground black pepper",
        "1/2 tsp ground ginger",
        "2 tsp salt"
      ],
      "ingOpt": []
    },
    {
      "ingTitle": "Pav bhaji",
      "ingMand": [
        "For the pav, follow the burger buns recipe.",
        "4 tbsp coriander seeds",
        "2 large potatoes",
        "1/2 head of a small cauliflower",
        "1/2 large green pepper",
        "1/2 frozen green peas",
        "1 tbsp vegetable oil",
        "3 tbsp butter",
        "1 tsp cumin seeds",
        "2 medium red onion, finely chopped",
        "5 cm ginger, finely chopped",
        "7 cloves garlic, finely chopped",
        "2 green chilies, finely chopped (adjust to taste)",
        "3 large tomatoes, finely chopped",
        "1/3 cup tomato puree",
        "1.25 tsp salt",
        "1.25 cups water",
        "1 big tbsp pav bhaji masala (adjust to taste)",
        "2 tsp paprika (for color)",
        "1/2 tsp red chili powder (adjust to taste)",
        "2 tsp fenugreek leaves",
        "Cilantro",
        "1 large lemon, juiced"
      ],
      "ingOpt": []
    }
  ],
  "instructions": [
    {
      "insTitle": "Bhaji Masala Powder",
      "insSteps": [
        "Dry roast coriander seeds, cumin seeds, dried red chilies, cloves, fennel seeds, black cardamom and cinnamon stick in a pan on medium heat until fragrant, around 3 to 4 minutes.",
        "Let it cool and then transfer spices to a spice grinder. Stir turmeric powder, ground black pepper, ground ginger and black salt.",
        "Grind until powdered and well combined. Store pav bhaji masala in an airtight container at room temperature and use as required. This makes around 100 grams of pav bhaji masala."
      ]
    },
    {
      "insTitle": "Pav Bhaji",
      "insSteps": [
        "Boil the veggies first and keep them ready.",
        "Heat one tablespoon of butter and oil in a large pot on medium heat. Once the butter melts and oil is hot, add the cumin seeds and let them sizzle.",
        "Add the finely chopped onions. Cook the onions for around 4 minutes until golden brown in color. Add the finely chopped ginger, garlic and green chili. Cook for 1 minute.",
        "Add chopped tomatoes and mix well. Let the tomatoes cook for 2 minutes.",
        "Add tomato puree, 1/4 cup water and 1/4 teaspoon salt. Cover the pan and let the tomato cook for 6 minutes until softened and completely cooked.",
        "Add the pav bhaji masala, paprika powder, red chili powder and remaining 1 teaspoon of salt. You may also add 1/2 teaspoon of sugar here (optional). Mix well and then add in 2 teaspoons of kasuri methi (dried fenugreek leaves).",
        "Stir in the boiled veggies and mix. Using a potato masher, mash the veggies until they are completely mixed with the masala.",
        "Add the remaining 3/4–1 cup water and mix. I used an immersion blender to blend the veggies to a paste like consistency at this point but this is optional. You may keep them as such.",
        "Cover the pot and set heat to low. Let the bhaji simmer on low heat for 15 minutes.",
        "Open the pot and add in the remaining 2 tablespoons of butter.",
        "Add a generous amount of chopped cilantro.",
        "Then add in juice of 1 large lemon. Let the bhaji simmer for 2 more minutes and then remove pan from heat."
      ]
    },
    {
      "insTitle": "Serve The Pav Bhaji",
      "insSteps": [
        "Start by toasting the pav. Do do so, melt butter on a pan on medium heat. Sprinkle some pav bhaji masala on top of the butter and then place the buns on the pan. Press to toast the pav until crisp and golden brown from both sides.",
        "To serve the pav bhaji, place ladle full of bhaji in a plate. Top the bhaji with a dollop of butter. Serve with 2 pavs and a side of chopped onions and a lemon wedge."
      ]
    }
  ],
  "notes": [],
  "sourceUrl": "./sourdough-burger-buns"
}
