{
  "title": "Italian pesto alla trapanese",
  "date": "2023-06-10",
  "dataTag": ["main", "prep-ahead", "summer"],
  "intro": "I discovered this pasta sauce recipe, as I was traveling with friends through Sicily in 2023. It is fresh, tomato-ey, and just perfect for summer.",
  "duration": "30",
  "ingredients": [
    {
      "ingTitle": "",
      "ingMand": [
        "3 medium cloves garlic",
        "A big handful of almonds, blanched and peeled",
        "A bouquet of basil, leaves only",
        "100 g Pecorino cheese (plus more for serving)",
        "500 g plum tomatoes (meaty ones), seeded",
        "Olive oil",
        "Busiate pasta (for the traditional Trapanese recipe, but any pasta will do)",
        "Salt"
      ],
      "ingOpt": ["2-4 mint leaves"]
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Crush the garlic in the mortar with a pinch of salt to form a paste. Add almonds and beat and crush into a rough paste. Work in basil leaves and mint (if using), pounding and crushing into tiny bits. Smash in cheese, followed by tomatoes and olive oil. The final sauce should be a rough paste. Season with salt.",
        "Transfer 2/3 of the sauce to a large heatproof serving bowl.",
        "In a pot of salted boiling water, cook the pasta until al dente. Transfer pasta to serving bowl, reserving some of the pasta-cooking water. Toss well, adding more olive oil and pasta-cooking water, one tablespoon at a time each, until a creamy sauce forms that's not dry but also not soupy. Season with salt, if needed. If the sauce gets too dry at any point, simply add more pasta-cooking water to loosen it.",
        "Serve, spooning remaining sauce on top of each portion and adding more cheese as desired."
      ]
    }
  ],
  "notes": [
    "Tip: Keep the sauce in the fridge and top the pasta with it before serving for the optimal hot and cold contrast."
  ],
  "sourceUrl": "https://www.seriouseats.com/pesto-alla-trapanese-sicilian-pesto-with-almonds-and-tomatoes"
}
