{
  "title": "Lebanese hummus",
  "date": "2023-04-27",
  "lang": "en",
  "dataTag": ["side", "spring", "summer", "fall", "winter"],
  "intro": "",
  "duration": "",
  "ingredients": [
    {
      "ingTitle": "",
      "ingMand": [
        { "value": 1, "type": "cup", "name": "dry chickpeas" },
        {
          "value": [1, 2],
          "type": "",
          "name": "garlic cloves",
          "prep": "pressed"
        },
        { "value": 0.5, "type": "cup", "name": "tahini" },
        { "value": 2, "type": "", "name": "lemons", "prep": "juiced" },
        { "value": 1, "type": "tsp", "name": "salt" },
        "Olive oil"
      ],
      "ingOpt": [
        { "value": [2, 3], "type": "", "name": "ice cubes" },
        { "value": 1, "type": "tbsp", "name": "baking soda" },
        "Cumin and paprika"
      ]
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Soak the chickpeas in a large bowl full of water. Add 1 tablespoon of baking soda, stir and soak overnight. The chickpeas should double in size the next day.",
        "Rinse the chickpeas and place in a pot with double the amount of cold water. Add 1 teaspoon of bicarbonate and stir well.",
        "Bring to the boil, then lower the heat and cook for an hour. Skim off any scum from the surface and top up the boiling water if it runs low.",
        "Test one chickpea by squishing it between your fingers, the skin should come away easily.",
        "Drain the chickpeas into a colander but reserve one cup of the water aside.",
        "Put the chickpeas in the blender along with the tahini, lemon juice, garlic and salt along with a drizzle of extra virgin olive oil",
        "Blend the chickpeas for a few minutes. Add 2–3 ice cubes and whizz again until smooth.",
        "Taste the hummus and add more lemon, salt, tahini or chickpea water as necessary to get the perfect texture.",
        "Drizzle with good extra virgin olive oil upon serving."
      ]
    }
  ],
  "notes": [
    "Note: If, for some reason, you ended up using more liquid than you should have or if you still want a thicker consistency, you can add a bit more tahini. And if you chill the hummus for an hour or so before adding any garnish, that should help as well. Another thing you can add to thicken your hummus is 1–2 tablespoons of Greek yogurt."
  ],
  "sourceUrl": "https://zaatarandzaytoun.com/best-hummus-recipe/"
}
