{
  "title": "Persian rice pilaf (sabzi polo)",
  "date": "2022-11-09",
  "lang": "en",
  "dataTag": ["side", "spring", "summer", "fall"],
  "intro": "One of my go-to recipes for when I have a lot of parsley I want to finish.",
  "duration": "120",
  "ingredients": [
    {
      "ingTitle": "",
      "ingMand": [
        { "value": 2, "type": "cups", "name": "basmati rice" },
        { "value": 8.25, "type": "cups", "name": "water" },
        {
          "value": 5,
          "type": "cups",
          "name": "fresh herbs (dill, parsley, cilantro)",
          "prep": "thinly chopped"
        },
        {
          "value": 12,
          "type": "",
          "name": "garlic cloves",
          "prep": "coarsely chopped"
        },
        { "value": 3, "type": "tbsp", "name": "salt" },
        { "value": 4, "type": "tbsp", "name": "oil" }
      ],
      "ingOpt": [
        { "value": 1, "type": "tbsp", "name": "dried fenugreek leaves" }
      ]
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Place 2 cups basmati rice in a medium bowl, cover with water, and let soak 1 hour. Meanwhile, coarsely chop the garlic and thinly chop the herbs.",
        "When the rice is ready, drain in a fine-mesh strainer and rinse until the water runs clear. Bring 8 cups of the water and 3 tablespoons kosher salt to a boil in a big pot over high heat. Add the rice and boil uncovered until the rice has slightly softened but still has a bite to it, 5 to 7 minutes. Drain the rice in a colander and quickly rinse with warm water.",
        "Add the parboiled rice to the herbs and gently stir until the rice and herbs are combined. Add fenugreek.",
        "Wipe the pot dry. Add 2 tablespoons of the vegetable oil and spread it around. Fill the pot with the herb rice and lightly fluff with a fork.",
        "Stir the remaining 1/4 cup water and remaining 2 tablespoons vegetable oil together in a small measuring cup and pour evenly over the top of the rice. Wrap the lid of the pot with a clean kitchen towel or paper towels and place on top of the pot. This will allow the rice to steam.",
        "Cook the rice undisturbed (do not lift the lid) over medium-low heat for 45 to 50 minutes. Remove the pot from the heat and let cool 5 minutes.",
        "Uncover the pot. Invert a large plate or platter (wider than the pot) over the pot. Grasping both the plate and the pot with oven mitts, carefully and swiftly flip the rice onto the serving plate. Remove the pot."
      ]
    }
  ],
  "notes": [],
  "sourceUrl": "https://www.thekitchn.com/sabzi-polo-recipe-23136179"
}
