{
  "title": "Seeded multigrain crackers",
  "date": "2025-11-20",
  "lang": "en",
  "dataTag": ["snack", "spring", "summer", "fall", "winter"],
  "intro": "",
  "duration": "",
  "ingredients": [
    {
      "ingTitle": "50 crackers",
      "ingMand": [
        { "value": 230, "type": "g", "name": "mix of flours" },
        { "value": 1.5, "type": "tsp", "name": "sugar" },
        {
          "value": 1,
          "type": "tsp",
          "name": "salt"
        },
        "Cayenne pepper",
        { "value": 2, "type": "tsp", "name": "sourdough starter" },
        { "value": 125, "type": "g", "name": "water" },
        { "value": 1.5, "type": "tbsp", "name": "oil" },
        "Mixed seeds",
        "Flaky salt and pepper"
      ],
      "ingOpt": []
    }
  ],
  "instructions": [
    {
      "insTitle": "Dough",
      "insSteps": [
        "In a large mixing bowl, mix together the flour, along with the sugar, salt, cayenne and sourdough starter. Add the water and oil, and mix until the dough comes together in a shaggy mass.",
        "Knead the dough with your hands a few times, either in the bowl or on the counter, until it comes together and is relatively smooth.",
        "Divide the dough in two, shape each half into a rectangle and place them on a plate. Cover, and refrigerate for 1–2 hours. (The dough can be refrigerated up to 24 hours in advance.)"
      ]
    },
    {
      "insTitle": "Baking",
      "insSteps": [
        "Preheat the oven to 200 ºC. Line two baking sheets with parchment paper.",
        "Remove one rectangle of cracker dough from the refrigerator. (Leave the other rectangle in; the dough is easier to roll if well-chilled.) Place a good amount of the seed mixture on a counter. Sprinkle with sea salt and black pepper and press the dough into the seeds. Turn the dough over and press the other side of the dough into the seeds. Use a rolling pin to roll the dough into a square approximately 30 x 30 cm, rotating and turning the dough over as you roll, to prevent sticking, adding more seeds (as well as a sprinkle of salt and pepper) when it starts to stick. Both sides of the dough should be well-riddled with seeds.",
        "Cut the dough into rectangles or diamonds with a knife, and place them on the prepared baking sheet. Bake the crackers until well-browned across the top, about 8–10 minutes, turning the baking sheet midway during baking. Let crackers cool.",
        "Roll, cut, and bake the remaining rectangle of dough the same way you did the first one."
      ]
    }
  ],
  "notes": [
    "Storage: The crackers will keep in an air-tight container at room temperature for several weeks. If they lose their crispness, they can be refreshed on a baking sheet for a few minutes in a moderate oven."
  ],
  "sourceUrl": "https://www.davidlebovitz.com/seeded-multigrain-crackers-recipe/"
}
