{
  "title": "Sourdough burger buns",
  "date": "2021-01-22",
  "lang": "fr",
  "dataTag": ["side", "spring", "summer", "fall", "winter"],
  "intro": "",
  "duration": "",
  "ingredients": [
    {
      "ingTitle": "",
      "ingMand": [
        { "value": 200, "type": "g", "name": "levain" },
        { "value": 300, "type": "g", "name": "farine blanche" },
        { "value": 299, "type": "g", "name": "farine semi-complète (T110)" },
        { "value": 8, "type": "g", "name": "sel" },
        { "value": 16, "type": "g", "name": "sucre" },
        {
          "value": 200,
          "type": "g",
          "name": "lait à température ambiante (ou de l'eau)"
        },
        { "value": 60, "type": "g", "name": "beurre mou" },
        { "value": 1, "type": "", "name": "œuf" }
      ],
      "ingOpt": [
        { "value": 1, "type": "", "name": "jaune d'œuf" },
        "Graines de sésame"
      ]
    }
  ],
  "instructions": [
    {
      "insTitle": "",
      "insSteps": [
        "Pétrisser grossièrement à la main les farines, le lait, l'oeuf, le sucre, le sel et levain en veillant à ce le levain n'entre pas en contact direct avec le sel.",
        "Au fur et à mesure, ajouter les dés de beurre mou.",
        "Pétrisser le tout 15 à 20 minutes jusqu'à ce que la pâte se décolle des parois de votre bol, qu'elle soit souple et ferme.",
        "Réserver une nuit dans un grand bol recouvert d'un linge sec et propre, celui-ci va pousser et doubler de volume.",
        "Dégazer la pâte en chassant l'air à la main et en pétrissant brièvement à la main. Peser la pâte, puis diviser-la en 8 pâtons de poids égal.",
        "Former des boules avec les pâtons en les roulant sur le plan de travail et laisser les pâtons de nouveau doubler de volume sur une plaque allant au four, chemisé de papier cuisson, couvert d'un linge. Cela devrait prendre quelques heures.",
        "Préchauffer le four à 200 °C.",
        "Badigeonner les buns de jaune d'oeuf (mélangé à un peu d'eau), saupoudrer de graines de sésame et enfourner pour 13–15 minutes. Laisser refroidir sur une grille, c'est prêt !"
      ]
    }
  ],
  "notes": [
    "Note : cette recette nécessite 6–8 heures de \"bulk rising\".",
    "Tip : la deuxième montée des pains individuellement est plus importante que la première. Mieux vaut racourcir la première durée de montée plutôt que la deuxième. Si la seconde montée est trop lente, vous pouvez chauffer votre four à 35 °C avec une casserole d'eau bouillante posée sur le bas. Placez votre plaque de buns au milieu du four pendant quelques heures, en vous assurant qu'ils ne s'assèchent pas. Vous pouvez humidifier leurs surfaces de temps en temps."
  ],
  "sourceUrl": "http://www.grainedefaimkely.com/2020/04/pain-burger-au-levain.html"
}
