{
  "title": "Sourdough bread",
  "date": "2025-09-11",
  "lang": "en",
  "dataTag": ["side", "spring", "summer", "fall", "winter"],
  "intro": "",
  "duration": "",
  "ingredients": [
    {
      "ingTitle": "",
      "ingMand": [
        "125 g sourdough starter",
        "350 g water",
        "300 g wheat flour (T80)",
        "200 g whole wheat flour (T110)",
        "9 g salt"
      ],
      "ingOpt": ["Herbs, seeds, dry fruits"]
    }
  ],
  "instructions": [
    {
      "insTitle": "Timeline for the overnight method",
      "insSteps": [
        "Day 1, morning. Refresh the sourdough starter twice, to have it ready by the afternoon.",
        "Day 1, 15:20. Mix all ingredients to make the dough.",
        "Day 1, 16:00. Perform 4 sets of folds 30 minutes apart.",
        "Day 1, 17:30. Let rest one extra hour for the bulk fermentation.",
        "Day 1, 18:30. Shape the dough, place in a banneton, and let rise for 12­–13 hours in the fridge.",
        "Day 2, early morning: Score and bake."
      ]
    },
    {
      "insTitle": "Timeline for the same day method",
      "insSteps": [
        "Day 1, late evening. Refresh the sourdough starter. Use a small proportion of starter, to have it rise slowly until the next morning.",
        "Day 2, 7:20. Mix all ingredients to make the dough.",
        "Day 2, 8:00. Perform 4 sets of folds 30 minutes apart.",
        "Day 2, 10:30. Let rest 3–6 extra hours for the bulk fermentation.",
        "Day 2, 14:30. Preshape dough on a wet counter, let rest 30 minutes.",
        "Day 2, 15:00. Shape, place in a banneton, and let rise for 1–2 hours.",
        "Day 2, 16:30: Score and bake."
      ]
    },
    {
      "insTitle": "Mix the dough",
      "insSteps": [
        "In a bowl, dilute the sourdough starter in the water. Add the flour, and mix until the dough is smooth. There is no need to knead, the ingredients simply need to be combined.",
        "Cover with a clean cloth and let rest for 20 minutes in a warm place (24 °C) or in the turned-off oven.",
        "Add the salt (and optional herbs/seeds), and incorporate it by pushing in with your fingers while rotating the bowl with your other hand. Knead lightly until the dough is homogenous. Let rest 20 minutes."
      ]
    },
    {
      "insTitle": "Bulk fermentation: stretch and fold",
      "insSteps": [
        "Keep a glass of water on the side to wet your fingers as you work the dough (it will stick less). On one side of the bowl, reach under the dough. Grab this side of the dough, pull it up, and bring it to the top. Turn the bowl a quarter turn and repeat this process three times to go all the way around. Wet your fingers to avoid having dough stick to your hands. Cover and let rest.",
        "Repeat the previous folding step every 30 minutes. Four folds in total (counting the first one) are enough. The dough should have risen for 1 h 30 after your fourth and last fold. Let rest one extra hour without folding."
      ]
    },
    {
      "insTitle": "Second rise: in a banneton",
      "insSteps": [
        "Pour the dough onto a floured work surface. To avoid damaging the dough and deflating it, use a dough scraper. Fold all sides of the dough toward the center, and turn it over (so that the seam-side is down). Gently cup the dough, pulling and twisting until it forms a tight skin with surface tension on the outside of the dough ball. Place the dough in a floured banneton, cover with a wrap, and let rest in the refrigerator for 12­–13 hours."
      ]
    },
    {
      "insTitle": "Bake",
      "insSteps": [
        "30 minutes or so before the dough is ready to bake, preheat your oven to 230 °C, with the empty dutch oven inside.",
        "When ready to bake, remove the banneton from the refrigerator. Turn the loaf out onto a sheet of baking paper. Sift the bread with flour and score (make indentations) with a sharp razor blade.",
        "Remove the dutch oven from the oven and take off the lid. Place the sheet of paper (with the dough on top) in the dutch oven.",
        "Place the lid back onto the dutch oven, return it to the oven and bake for 20 minutes at 230 °C.",
        "Remove the lid and bake uncovered for an additional 30 minutes at 200 °C or until the crust is golden brown.",
        "Let the bread cool on a cooling rack for 1–2 hours before slicing to prevent it from becoming gummy."
      ]
    }
  ],
  "notes": [
    "Make sure your sourdough starter is at its best for an optimal result. I usually try to refresh it in two phases (instead of all at once) before using it.",
    "How to check if the dough is ready to bake? Use your thumb to make an indentation in the dough about a half inch deep. If the indention springs back very slowly, the dough is ready to bake. If the indentation quickly springs back all the way, or almost all the way, it's still needs more time to rise. If the indention doesn't spring back at all, it's more than likely over-proofed."
  ],
  "sourceUrl": ""
}
