{
  "title": "Sushi / gimbap",
  "dateCreated": "2024-05-12",
  "dataTag": ["main", "spring", "fall", "winter", "summer"],
  "intro": "On fait une pause de deux mois à Hanoi lors de notre voyage de l'Europe à l'Asie. On y loue un appart pas cher avec une toute petite cuisine à peine fonctionnelle. Que peut-on préparer avec un minimum de 'cuisine' nécessaire et avec des ingrédients disponibles ? Je me lance dans des rouleaux inspirés des sushis japonais et gimbaps coréens.",
  "duration": "60",
  "ingredients": [
    {
      "ingTitle": "Riz vinaigré",
      "ingMand": [
        "3 bols de riz",
        "3 c-à-s vinaigre de riz",
        "1.5 c-à-s sucre",
        "Sel"
      ],
      "ingOpt": []
    },
    {
      "ingTitle": "Rouleaux",
      "ingMand": [
        "6 feuilles de nori",
        "1 canette de thon avec un peu de mayo (ou fromage frais)",
        "4 oeufs, cuits en oeufs brouillés ou omelette",
        "Carottes vinaigrées"
      ],
      "ingOpt": ["Epinards blanchis (ou similaire)"]
    },
    {
      "ingTitle": "Sauce",
      "ingMand": [
        "4 c-à-s sauce soja",
        "2 c-à-s vinaigre de riz",
        "1 c-à-s sucre",
        "Eau"
      ],
      "ingOpt": []
    }
  ],
  "instructions": [
    {
      "insTitle": "Cuire le riz",
      "insSteps": [
        "Préparer le mélange vinaigre, sucre et sel en avance.",
        "Cuire le riz et le laisser refroidir quelques minutes.",
        "Délicatement ajouter le mélange vinaigré dans le riz et continuer à le laisser refroidir."
      ]
    },
    {
      "insTitle": "Assembler les rouleaux",
      "insSteps": [
        "Sur une feuille de nori, étaler une fine couche de riz. Laisser une bande horizontale vide de 2–3 cm tout en haut.",
        "Disposer les autres ingrédients sur une ligne horizontale au milieu du riz.",
        "Délicatement enrouler l'algue sur elle-même. Le riz doit être un maximum compressé (pour faciliter la découpe des rondelles), mais pas trop fort pour ne pas déchirer l'algue.",
        "Légèrement mouiller la partie d'algue vide pour pouvoir la refermer et la coller au reste du rouleau.",
        "(Optionnel) Recouvrir le rouleau d'huile de sésame."
      ]
    },
    {
      "insTitle": "Servir",
      "insSteps": [
        "Mélanger les ingrédients de la sauce et les laisser reposer.",
        "Avant de découper un rouleau, il est peut-être nécessaire d'aiguiser son couteau et de le mouiller un peu pour éviter de déchirer l'algue.",
        "Le geste de découpe se fait en 'sciant' le rouleau doucement, sans trop forcer. Si l'algue déchire, réaiguiser et mouiller le couteau.",
        "Déguster avec une bière bien fraîche !"
      ]
    }
  ],
  "notes": [
    "Note : Alors effectivement, ce ne sont là ni des gimbaps, ni des sushis. Les ingrédients sont complètement faux et les méthodes de cuisine se mélangent. Mais en tout cas, c'est facile et c'est bon."
  ],
  "sourceUrl": ""
}
