{
  "title": "Thai pad thai",
  "date": "2023-09-22",
  "lang": "en",
  "dataTag": ["main", "spring", "summer", "fall", "winter"],
  "intro": "",
  "duration": "45",
  "ingredients": [
    {
      "ingTitle": "Sauce",
      "ingMand": [
        { "value": 40, "type": "g", "name": "tamarind pulp" },
        { "value": 120, "type": "ml", "name": "boiling water" },
        { "value": 3, "type": "tbsp", "name": "sugar" },
        { "value": 3, "type": "tbsp", "name": "fish sauce" },
        { "value": 2, "type": "tbsp", "name": "dark soy sauce" },
        "Pepper"
      ],
      "ingOpt": []
    },
    {
      "ingTitle": "Rest of the dish",
      "ingMand": [
        {
          "value": 230,
          "type": "g",
          "name": "dried pad thai noodles (or Vietnamese banh pho)"
        },
        { "value": 3, "type": "", "name": "garlic cloves", "prep": "sliced" },
        { "value": 2, "type": "", "name": "shallots", "prep": "thinly sliced" },
        { "value": 3, "type": "", "name": "large eggs", "prep": "beaten" },
        {
          "value": 2,
          "type": "handfuls",
          "name": "mung beans sprouts",
          "prep": "washed and drained"
        },
        {
          "value": 1,
          "type": "handful",
          "name": "green onion",
          "prep": "cut into 2 cm pieces"
        },
        {
          "value": 2,
          "type": "tbsp",
          "name": "roasted peanuts",
          "prep": "roughly crushed"
        },
        "Cooking oil"
      ],
      "ingOpt": [
        {
          "value": 2,
          "type": "tbsp",
          "name": "preserved Thai salted radish (or kimchi)",
          "prep": "julienned"
        },
        {
          "value": 0.3,
          "type": "cup",
          "name": "small dried shrimps",
          "prep": "minced or processed into a coarse powder"
        }
      ]
    }
  ],
  "instructions": [
    {
      "insTitle": "Preparation",
      "insSteps": [
        "Soak the dried noodles in hot water for about 15–20 minutes, and drain in a colander (the noodle should still be crunchy). If the noodles are in really long strands, you will want to cut them into 20 cm length to make stir-frying easier.",
        "First, make the sauce. Take the tamarind pulp (a block about 2.5 x 5 cm) and mix it with ½ cup boiling water (you can add a little more if needed to dissolve the paste). Break up the pulp in the hot water, and then press the mixture through a fine-meshed strainer. Discard the solids.",
        "To the liquid tamarind concentrate you just made, add the sugar, fish sauce, soy sauce, and pepper. Taste, adjust if necessary and set aside.",
        "Next, prepare the dried shrimp, mincing them down into a coarse powder (we used a food processor).",
        "Already prepare the garlic, shallots, preserved Thai radish, eggs, mung bean sprouts, garlic chives, and peanuts. You want to have everything ready to go before you turn on the stove."
      ]
    },
    {
      "insTitle": "Bring everything together",
      "insSteps": [
        "Now you’re ready to cook! Heat 2 tablespoons of oil in your wok over medium heat. Add the shrimp powder and fry until fragrant and crisp, 2 minutes.",
        "Add the garlic, and cook for 30 seconds. Add the shallots and preserved radish. Stir-fry for another 30 seconds.",
        "Turn the heat up to high, and add the noodles and sauce. Stir-fry to combine, lifting the noodles with your wok spatula to spread them out and break them up. Cook until almost ready.",
        "Make a space on the side of the wok, pushing the noodles to one side. Drizzle 1 more tablespoon of oil in the open space, and pour in the beaten eggs. Use your spatula to fold them gently, scrambling them without breaking up the egg too much. When the eggs are about 70% done, stir-fry to distribute them into the noodles.",
        "Next, add the bean sprouts and the chives. Stir-fry to combine, letting the chives wilt.",
        "Plate, top with the crushed peanuts, and serve!"
      ]
    }
  ],
  "notes": [
    "Tip 1: When soaking the noodles, it is better to leave them too little rather than too long.",
    "Tip 2: Make sure you have enough sauce to cook your noodles with."
  ],
  "sourceUrl": "https://thewoksoflife.com/pad-thai/"
}
